{"type":"data","nodes":[{"type":"data","data":[null],"uses":{}},{"type":"data","data":[{"document":1,"metadata":1276},{"pandoc-api-version":2,"meta":5,"blocks":23},[3,4,3],1,22,{"date":6,"draft":12,"title":15,"url":19},{"t":7,"c":8},"MetaInlines",[9],{"t":10,"c":11},"Str","2016-09-09T13:07:00.002-04:00",{"t":13,"c":14},"MetaBool",false,{"t":7,"c":16},[17],{"t":10,"c":18},"The efficient plots hypothesis",{"t":7,"c":20},[21],{"t":10,"c":22},"\u002F2016\u002F09\u002Fthe-efficient-plots-hypothesis.html",[24,50,100,112,127,137,145,149,153,170,193,205,221,225,229,233,254,264,274,299,303,323,327,331,340,359,363,367,386,397,401,405,407,416,436,440,444,454,456,465,482,494,506,518,520,529,546,550,554,556,565,582,626,630,634,636,645,662,666,670,674,678,680,689,709,713,717,719,728,747,766,770,794,812,816,820,824,828,830,839,859,863,865,872,889,893,895,904,921,925,929,933,937,939,948,965,969,973,975,984,1001,1005,1023,1027,1029,1038,1055,1059,1063,1065,1074,1093,1119,1131,1135,1139,1143,1145,1154,1171,1181,1185,1189,1193,1197,1225,1229,1241,1243,1252,1270,1274],{"t":25,"c":26},"Para",[27,29,41,43,48],{"t":10,"c":28},"I’m pulling this discussion out of the comments thread on ",{"t":30,"c":31},"Link",[32,36,39],[33,34,35],"",[],[],[37],{"t":10,"c":38},"Scott Enderle’s blog",[40,33],"http:\u002F\u002Fwww.lagado.name\u002Fblog\u002Fbrownian-noise-and-plot-arcs\u002F",{"t":10,"c":42},", because it’s fun. This is the formal statement of what will forever be known as the ",{"t":44,"c":45},"Strong",[46],{"t":10,"c":47},"efficient plot hypothesis for plot arceology",{"t":10,"c":49},". Noble prize in culturomics, here I come.",{"t":25,"c":51},[52,54,64,66,76,78,88,90,98],{"t":10,"c":53},"Brief background: Enderle shows pretty persuasively that all the fundamental plot arcs ",{"t":30,"c":55},[56,59,62],[33,57,58],[],[],[60],{"t":10,"c":61},"described in a paper by a math-based computational story lab",[63,33],"https:\u002F\u002Farxiv.org\u002Fabs\u002F1606.07772",{"t":10,"c":65}," can be ascribed to random (brownian) noise. As I wrote ",{"t":30,"c":67},[68,71,74],[33,69,70],[],[],[72],{"t":10,"c":73},"earlier",[75,33],"https:\u002F\u002Fsappingattention.blogspot.com\u002F2016\u002F07\u002Fplot-arceology-emotion-and-tension.html",{"t":10,"c":77},", and ",{"t":30,"c":79},[80,83,86],[33,81,82],[],[],[84],{"t":10,"c":85},"Hannah Walser explored in more depth recently",[87,33],"https:\u002F\u002Flitlab.stanford.edu\u002Fhumanities-without-humanists\u002F",{"t":10,"c":89},", that this happens with their data isn’t so surprising; the ",{"t":91,"c":92},"Quoted",[93,95],{"t":94},"DoubleQuote",[96],{"t":10,"c":97},"stories",{"t":10,"c":99}," they are modeling are mostly random documents to begin with.",{"t":25,"c":101},[102,104,110],{"t":10,"c":103},"Still, there’s some reason to think that maybe sentiment trajectories are random walks even in actual databases of stories like those Matt Jockers uses. Enderle finds that, well, weird: ",{"t":91,"c":105},[106,107],{"t":94},[108],{"t":10,"c":109},"Should we find that sentiment data from novels does indeed amount to “mere noise,",{"t":10,"c":111}," literary critics will have some very difficult questions to ask themselves about the conditions under which noise signifies.” The idea that plots are random seems offensive to the idea of plot at all. Others in the field, like Jockers and Ted Underwood, have also expressed the idea that there should be some regularities to plot, particularly that map across genre.",{"t":25,"c":113},[114,116,125],{"t":10,"c":115},"I had earlier raised the idea that ",{"t":30,"c":117},[118,121,124],[33,119,120],[],[],[122],{"t":10,"c":123},"the null hypothesis for plot testing should be a random walk",[75,33],{"t":10,"c":126}," (Brownian noise, as Enderle calls it) but I thought of it as just that–a null hypothesis that indicates nothing interesting is going on.",{"t":25,"c":128},[129,131,135],{"t":10,"c":130},"But of course, it *would be interesting if nothing was going on.* It would demand explanation! And now I’ve got one: the ",{"t":44,"c":132},[133],{"t":10,"c":134},"efficient plots hypothesis,",{"t":10,"c":136}," a corollary of the efficient markets hypothesis (EMH) for the literary world.",{"t":25,"c":138},[139,141,143],{"t":10,"c":140},"The EMH states that stock prices are efficient; you can’t know reliably if they’re about to go up or down, because if they were someone would have bought them. There’s been a lot of research on whether stocks move in Brownian noise; they don’t, totally, but they come pretty close.",{"t":142},"LineBreak",{"t":10,"c":144},"The EPH, as I imagine it, says that the ideal reader can’t know if the mood of a book is about to get sunnier or darker at any given point in the plot. This not because of market forces directly, but because the purpose of a narrative is to engross the reader. Engrossment proceeds through uncertainty. If you knew what was about to happen, you’d skim ahead or stop reading.",{"t":25,"c":146},[147],{"t":10,"c":148},"That is: at any moment in a story, the emotional trajectory is a random walk for the reader because anything else would be *boring.* And stories aren’t boring.",{"t":25,"c":150},[151],{"t":10,"c":152},"This could be tested empirically by asking readers if a book will get more positive or more negative over the next five pages, and by how much. In a pure EPH world, they’ll only be right about half the time. Enderle thinks the EPH is obviously wrong, particularly for genre fiction.",{"t":25,"c":154},[155,157,158,160,161,163,168],{"t":10,"c":156},"I’m not so sure. To take an example: I read some John le Carré novels over the summer. Periodically, a spy has to secretly pass from the East to the West without getting by the commies. (Through the Berlin wall, over the Chinese border to Hong Kong, etc.) Do you know if they’ll make it? The emotional sentiment of the next few pages depends on whether they get killed or not. I can see two models here:",{"t":142},{"t":10,"c":159},"1. Genre determines plot arceology: There are conventions to the spy novel that make it possible to tell in advance.",{"t":142},{"t":10,"c":162},"2. The EPH: The whole point of reading a spy novel is that you ",{"t":164,"c":165},"Emph",[166],{"t":10,"c":167},"don’t",{"t":10,"c":169}," know what will happen; the job of a spy novelist is to make you unsure.",{"t":25,"c":171},[172,174,175,177,191],{"t":10,"c":173},"My reading experience is much closer to the latter; that the conventions of genre fiction are *precisely* that you don’t know what’s going to happen next; otherwise no one would read it.",{"t":142},{"t":10,"c":176},"For most good genre fiction, I think this holds. Will Lockhardt\u002FGardner win the case? Is Don Draper going to hit the bottle or stay sober? The rise of ",{"t":91,"c":178},[179,180],{"t":94},[181],{"t":30,"c":182},[183,186,189],[33,184,185],[],[],[187],{"t":10,"c":188},"anyone can die",[190,33],"http:\u002F\u002Fvariety.com\u002F2016\u002Ftv\u002Fopinion\u002Ftv-deaths-walking-dead-the-100-arrow-1201751968\u002F",{"t":10,"c":192}," as the predominant trope of 2010s TV suggests that the economics are forcing stronger and stronger forms of the EPH onto us every day.",{"t":25,"c":194},[195,197,203],{"t":10,"c":196},"The major objection to this would be: ",{"t":91,"c":198},[199,200],{"t":94},[201],{"t":10,"c":202},"but there *are* genres where you know the outcomes precisely!",{"t":10,"c":204}," In a Hardy Boys novel, they’ll rebound from danger and catch the bad guy every time. One response to this is: sure, *you* know that; but you don’t read Hardy boys novels. The people who do are 10-year-olds who legitimately think that, just maybe, the killer’s going to drown the brothers in the quarry and the next 20 books on the shelf will turn out to be prequels.",{"t":25,"c":206},[207,209,213,215],{"t":10,"c":208},"Even if you know how certain books will *end*, that doesn’t mean that you’ll ever be able to predict the ",{"t":44,"c":210},[211],{"t":10,"c":212},"next two pages,",{"t":10,"c":214}," which is what this is about. I think this distinction is crucially important and maybe underestimated. Sure, a romantic comedy always has a temporary breakup in the middle; but whether that happens 40% of the way through or 70% of the way through makes all the difference; and if you’ve made it 90% of the way through without the breakup happening, you start to think ",{"t":91,"c":216},[217,218],{"t":94},[219],{"t":10,"c":220},"maybe this is one of those comedies without a breakup in it.",{"t":25,"c":222},[223],{"t":10,"c":224},"If the EPH holds, then, it doesn’t suggest that fiction is truly arbitrary; rather, that it’s an elaborately constructed game between reader and writer, socially conditioned and in no way permanent. It would suggest that there are enough fundamental plots that at any point in a book you are unsure what plot you are in; and that plots tend to wear themselves out over time.",{"t":25,"c":226},[227],{"t":10,"c":228},"It does completely throw into the ringer my analogy between musical tonality and emotional valence. Key signatures in music are highly predictable. But I think that’s OK: it’s really clear that there aren’t underlying structures quite so strong as sonata form under novels; this would explain why.",{"t":25,"c":230},[231],{"t":10,"c":232},"For a lunatic idea, the EPH is actually empirically kind of testable. Just ask people to predict the direction of books as they’re reading them. Someone could totally do this. Maybe some movie studios even do.",{"t":234,"c":235},"Header",[236,237,241],2,[238,239,240],"for-more-details-see-my-forthcoming-book-with-stephen-dubner-jane-austen-was-a-derivatives-trader-harper-collins-2017.",[],[],[242,244,248,250],{"t":10,"c":243},"For more details, see my forthcoming book with Stephen Dubner, ",{"t":164,"c":245},[246],{"t":10,"c":247},"Jane Austen was a Derivatives Trader ",{"t":10,"c":249}," (Harper Collins 2017)",{"t":164,"c":251},[252],{"t":10,"c":253},".",{"t":234,"c":255},[256,257,261],3,[258,259,260],"comments",[],[],[262],{"t":10,"c":263},"Comments:",{"t":234,"c":265},[266,267,271],4,[268,269,270],"this-was-really-interesting-to-read-as-a-fiction-w",[],[],[272],{"t":10,"c":273},"This was really interesting to read as a fiction w…",{"t":25,"c":275},[276,287,289,294,296],{"t":30,"c":277},[278,281,284],[33,279,280],[],[],[282],{"t":10,"c":283},"kb",[285,286],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F07420770741938876807","noreply@blogger.com",{"t":10,"c":288}," - ",{"t":290,"c":291},"RawInline",[292,293],"html","\u003Ctime datetime=\"2016-09-11T11:17:41.969-04:00\"\u003E",{"t":10,"c":295},"Sep 0, 2016",{"t":290,"c":297},[292,298],"\u003C\u002Ftime\u003E",{"t":25,"c":300},[301],{"t":10,"c":302},"This was really interesting to read as a fiction writer. I wonder if the tension between knowing how a book will end and not knowing what will be in the next two pages is actually crucial to some extent.",{"t":25,"c":304},[305,307,313,315,321],{"t":10,"c":306},"I recently finished my MFA and one technique that the writers there sometimes mention is the idea of pulling readers through a scene as opposed to pushing them through a scene. Basically, you say at the start of the story or scene how it ends or what the significance of it will be before going into the story in chronological order. The idea is if you say ",{"t":91,"c":308},[309,310],{"t":94},[311],{"t":10,"c":312},"That morning I sat down at my computer and started reading my emails",{"t":10,"c":314}," the reader isn’t going to be as interested in that sentence as if you say ",{"t":91,"c":316},[317,318],{"t":94},[319],{"t":10,"c":320},"Let me tell you about the day I met Pablo Escobar. That morning I say down at my computer and started reading my emails",{"t":10,"c":322},". You set an endpoint but interesting enough to hook the reader and vague enough that the question of how to reach that endpoint is intriguing.",{"t":25,"c":324},[325],{"t":10,"c":326},"Uncertainty is crucial to an interesting plot, but the reader also wants to trust the author knows what they’re doing and where they’re going. If there’s too much uncertainty, it might undermine the reader’s trust. Having some degree of signposting along the way probably helps.",{"t":328,"c":329},"RawBlock",[292,330],"\u003Chr \u002F\u003E",{"t":234,"c":332},[266,333,337],[334,335,336],"as-a-fiction-writer-i-find-this-way-of-looking-at",[],[],[338],{"t":10,"c":339},"As a fiction writer, I find this way of looking at…",{"t":25,"c":341},[342,352,353,356,357],{"t":30,"c":343},[344,347,350],[33,345,346],[],[],[348],{"t":10,"c":349},"Jim H.",[351,33],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F02088100982761595050",{"t":10,"c":288},{"t":290,"c":354},[292,355],"\u003Ctime datetime=\"2016-09-11T15:05:58.683-04:00\"\u003E",{"t":10,"c":295},{"t":290,"c":358},[292,298],{"t":25,"c":360},[361],{"t":10,"c":362},"As a fiction writer, I find this way of looking at fictional texts fascinating and love following the discussions going back and forth with regard to analyses of this art form.",{"t":25,"c":364},[365],{"t":10,"c":366},"As a philosopher, I have a quick critique of the point of this post. There are two things at work here, and they seem to get conflated in your approach.",{"t":25,"c":368},[369,371,377,379,385],{"t":10,"c":370},"First thing: readers of fiction read fiction along a timeline normally beginning from the time they immerse in page one and lasting until they close the book after reading ",{"t":91,"c":372},[373,374],{"t":94},[375],{"t":10,"c":376},"The End.",{"t":10,"c":378}," They are, let us say, ",{"t":91,"c":380},[381,382],{"t":94},[383],{"t":10,"c":384},"in time",{"t":10,"c":253},{"t":25,"c":387},[388,390,395],{"t":10,"c":389},"Second thing: textual analysis (such as Jockers’s—with whom, full disclosure, I have been in contact and who has performed a Sentiment Analysis on my first novel’s manuscript after I self-taught R and attempted same myself. But I disgress.) takes a look at a completed text in an, let us call it, arcetextural manner. The novel is complete. It has ended, and the analyst is no longer ",{"t":91,"c":391},[392,393],{"t":94},[394],{"t":10,"c":384},{"t":10,"c":396}," with the text. Rather, she is breaking down its linguistic or sentimental, etc., components and comparing them to others.",{"t":25,"c":398},[399],{"t":10,"c":400},"Here’s an analogy: You are walking along a new road. You don’t know what lies around the next bend—whether there’s a hill or a river you will have to deal with. But I’m flying a drone or satellite above you and can see the length of road you are traversing and know what you’re about to encounter. What’s more, I’ve seen dozens of others taking the same route and witnessed how they dealt with these so-called unknowns.",{"t":25,"c":402},[403],{"t":10,"c":404},"So, yes, the RWH or EPH works for the individual reader the first time through the text. But on second read and for analytic purposes, the plot is less important. The suspense is removed, and the elements that go into the text’s work as an artwork (or genre work) can be seen for what they are. We notice, for example, bits of foreshadowing. We find parallels in subplots that give things away. We observe characters’ behaviors that show us how they tend to act and witness how they conform (or don’t) in the crucial moment.",{"t":328,"c":406},[292,330],{"t":234,"c":408},[266,409,413],[410,411,412],"rereading-is-definitely-a-problem-for-this-theory",[],[],[414],{"t":10,"c":415},"Rereading is definitely a problem for this theory;…",{"t":25,"c":417},[418,428,429,432,434],{"t":30,"c":419},[420,423,426],[33,421,422],[],[],[424],{"t":10,"c":425},"Ben",[427,33],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F04856020368342677253",{"t":10,"c":288},{"t":290,"c":430},[292,431],"\u003Ctime datetime=\"2016-09-12T07:10:56.579-04:00\"\u003E",{"t":10,"c":433},"Sep 1, 2016",{"t":290,"c":435},[292,298],{"t":25,"c":437},[438],{"t":10,"c":439},"Rereading is definitely a problem for this theory; the implication is that no one will re-read a book until they’ve forgotten most of the plot points. That seems pretty unlikely.",{"t":25,"c":441},[442],{"t":10,"c":443},"It’s certainly true that something like Jockers’s technique takes a high-level view and compares them to others. But this is an answer to what they’re finding. It’s somewhat like mapping roads; but what’s striking so far is that the structures that have been uncovered are not what most people were expecting, at least on the page to page level. They look less like roads that all go to Rome, and more like stock prices that fluctuate randomly.",{"t":25,"c":445},[446,448,452],{"t":10,"c":447},"I don’t think that plots are actually random; they’re carefully constructed. (Like you say). But if they’re carefully constructed to look random–so as to maintain reader interest–that would explain why the ",{"t":164,"c":449},[450],{"t":10,"c":451},"aggregate",{"t":10,"c":453}," plots Jockers and others have been looking for show a less strong signal than some anticipated.",{"t":328,"c":455},[292,330],{"t":234,"c":457},[266,458,462],[459,460,461],"this-is-also-a-problem-for-the-eph-yeah.-because",[],[],[463],{"t":10,"c":464},"This is also a problem for the EPH, yeah. Because …",{"t":25,"c":466},[467,475,476,479,480],{"t":30,"c":468},[469,472,474],[33,470,471],[],[],[473],{"t":10,"c":425},[427,33],{"t":10,"c":288},{"t":290,"c":477},[292,478],"\u003Ctime datetime=\"2016-09-12T07:21:36.999-04:00\"\u003E",{"t":10,"c":433},{"t":290,"c":481},[292,298],{"t":25,"c":483},[484,486,492],{"t":10,"c":485},"This is also a problem for the EPH, yeah. Because if you say ",{"t":91,"c":487},[488,489],{"t":94},[490],{"t":10,"c":491},"Let me tell you about the day I met Pablo Escobar",{"t":10,"c":493}," and then start talking about e-mails, it’s pretty obvious that things are going to get emotionally negative. I can think of two answers, none of which I find especially convincing:",{"t":25,"c":495},[496,498,504],{"t":10,"c":497},"1. A sufficiently advanced sentiment analysis will tag ",{"t":91,"c":499},[500,501],{"t":94},[502],{"t":10,"c":503},"Pablo Escobar",{"t":10,"c":505}," as negative, and so the sentence itself knocks the sentiment location down; the question is now just if you have a positive or negative encounter with him, relative to the encounters with Pablo Escobar people are likely to have.",{"t":25,"c":507},[508,510,516],{"t":10,"c":509},"2. Although you know that the meeting with Escobar is coming, you don’t know *when*. So although I can predict that ",{"t":91,"c":511},[512,513],{"t":94},[514],{"t":10,"c":515},"eventually something bad will happen,",{"t":10,"c":517}," that’s a statement so vague that it can apply to anything. And just because you say you’ll meet Pablo Escobar, there’s nothing to say that you (the author) won’t go all Tristram Shandy and just never quite get to the point in the day when Escobar shows up, or that your main character is going to be a twenty-five year old comic character whose parents named him after a drug lord.",{"t":328,"c":519},[292,330],{"t":234,"c":521},[266,522,526],[523,524,525],"so-how-many-basic-plots-are-there-two-six-thir",[],[],[527],{"t":10,"c":528},"So, how many basic plots are there? Two? Six? Thir…",{"t":25,"c":530},[531,539,540,543,544],{"t":30,"c":532},[533,536,538],[33,534,535],[],[],[537],{"t":10,"c":349},[351,33],{"t":10,"c":288},{"t":290,"c":541},[292,542],"\u003Ctime datetime=\"2016-09-12T11:12:03.629-04:00\"\u003E",{"t":10,"c":433},{"t":290,"c":545},[292,298],{"t":25,"c":547},[548],{"t":10,"c":549},"So, how many basic plots are there? Two? Six? Thirteen? Twenty? 25? … As many as there are works of fiction? Folk have been asking and trying to answer this question since at least Aristotle’s time. It’s a fun game, but I don’t believe it can ever really be more than that. It’s never a hard science though data aggregators can, indeed, show us some relevant & interesting trends & tendencies.",{"t":25,"c":551},[552],{"t":10,"c":553},"A key assumption, here, and one I raised with MJ is that equating sentiment analysis with plot. He notes a correlation. He must. I find difficulty making that link and raised the question of dramatic irony. For example, in my ms. I used one sentence (the last) to throw the entire denouement (the protagonist’s hard-won epiphany and decision to make positive changes to his life) of my novel into question. It’s valence cannot be equated with everything it seeks to undermine, and the sentiment analysis is ill-equipped to bring the entire upward sweeping arc down. It treats it just like every other sentence with a similar number of words that rate analysis.",{"t":328,"c":555},[292,330],{"t":234,"c":557},[266,558,562],[559,560,561],"i-agree-with-most-of-what-you-say-here.-although",[],[],[563],{"t":10,"c":564},"I agree with most of what you say here. (Although …",{"t":25,"c":566},[567,575,576,579,580],{"t":30,"c":568},[569,572,574],[33,570,571],[],[],[573],{"t":10,"c":425},[427,33],{"t":10,"c":288},{"t":290,"c":577},[292,578],"\u003Ctime datetime=\"2016-09-12T11:39:41.055-04:00\"\u003E",{"t":10,"c":433},{"t":290,"c":581},[292,298],{"t":25,"c":583},[584,586,593,595,601,603,612,614,624],{"t":10,"c":585},"I agree with most of what you say here. (Although most of human knowledge is somewhere in between ",{"t":91,"c":587},[588,590],{"t":589},"SingleQuote",[591],{"t":10,"c":592},"hard science",{"t":10,"c":594}," and a ",{"t":91,"c":596},[597,598],{"t":589},[599],{"t":10,"c":600},"fun game",{"t":10,"c":602},".) ",{"t":30,"c":604},[605,608,611],[33,606,607],[],[],[609],{"t":10,"c":610},"I’v raised similar questions about whether sentiment analysis is the right tool here;",[75,33],{"t":10,"c":613}," in my attempts at this ",{"t":30,"c":615},[616,619,622],[33,617,618],[],[],[620],{"t":10,"c":621},"I’ve used topic models to ask what the closest thing to a single overarching plot arc in a corpus,",[623,33],"http:\u002F\u002Fdl.acm.org\u002Fcitation.cfm?id=2878250",{"t":10,"c":625}," which is not a method that lends itself well to declaring any particular number of basic clusters.",{"t":25,"c":627},[628],{"t":10,"c":629},"I’m also very sympathetic to the idea that the last sentence of a book potentially bears much more weight than any other; I think treating all sentences as equal deeply bears little relation to how readers read plot. I don’t know if there’s a good mathematical way to account for this.",{"t":25,"c":631},[632],{"t":10,"c":633},"If I can toss out yet another oddball thought in the comments, because it’s not worthy of living anywhere else: My gut instinct about distributions is that there are infinitely many possible plots, but that some are much more common. Distributionally I’d bet that usage follows Zipf’s law; so the number of possible plots is proportional to the logarithm of all the books ever written, and the most common single ur-plot (which I’d bet is the marriage plot, in some form, or else something like Campbell’s hero’s journey, but who knows…) is something like 2-10% of all the stories ever told. I am suspicious of methods that too eagerly lump oddball plots into larger categories, which I think the sentiment ones probably do.",{"t":328,"c":635},[292,330],{"t":234,"c":637},[266,638,642],[639,640,641],"i-love-your-term-ur-plot.-at-my-blog-i-used-my-no",[],[],[643],{"t":10,"c":644},"I love your term ur-plot. At my blog, I used my no…",{"t":25,"c":646},[647,655,656,659,660],{"t":30,"c":648},[649,652,654],[33,650,651],[],[],[653],{"t":10,"c":349},[351,33],{"t":10,"c":288},{"t":290,"c":657},[292,658],"\u003Ctime datetime=\"2016-09-12T16:18:33.208-04:00\"\u003E",{"t":10,"c":433},{"t":290,"c":661},[292,298],{"t":25,"c":663},[664],{"t":10,"c":665},"I love your term ur-plot. At my blog, I used my notion of Ur-Story—which I derived from The Epic of Gilgamesh—as the analytical framework to examine literary texts from ancients to moderns (Ivan Ilych, Hamlet, The Erasers [Robbe-Grillet], The Third Policeman, Pnin, Remainder, The Hour of the Star, The Metamorphosis, Malone Dies, Things Fall Apart, Henderson the Rain King, The Loser [Bernhard] and others). This was less a systematic academic exercise than a writer’s reading—in order to inform my own work.",{"t":25,"c":667},[668],{"t":10,"c":669},"My own opinion is less the marriage plot and more Campbell’s (who also derived much of his view from Gilgamesh & Carl Jung). Briefly, (great) literature (fiction, poetry, tragedy, comedy) arises as a direct response to becoming conscious of the scandal of mortality—the brute fact of realizing we are all of us going to die. The forms are myriad—laughing at the absurdity of it, it’s unavoidably tragic, let’s investigate and find someone to blame, surely there’s a way out, but love is eternal isn’t it?, make hay & entertain me while the sun shines, fuck it all, and on and on. (Even myth and religion grow out of this awareness, proposing consolation and a possible solution however misguided—and much of it makes for great literature.) It was Gilgamesh’s great grief at the death of his boon wildman companion that set him off on his hero’s journey to inquire of Utnapishtim the secret of immortality. That’s the nutshell.",{"t":25,"c":671},[672],{"t":10,"c":673},"I would wager greater than 2-10% of great literature finds its motivation in this Ur-Story—possibly ALL great literature does; at least that’s my feeling—my opinion. But great literature probably constitutes somewhat less than 2% of all stories ever told.",{"t":25,"c":675},[676],{"t":10,"c":677},"And, of course, crucial to this Comment is the distinction between Story (which I take to be the Substance of literature) and Plot (which I take to be the Form).",{"t":328,"c":679},[292,330],{"t":234,"c":681},[266,682,686],[683,684,685],"great-conjecture.-its-driving-me-crazy-that-i",[],[],[687],{"t":10,"c":688},"Great conjecture. It’s driving me crazy that I…",{"t":25,"c":690},[691,701,702,705,707],{"t":30,"c":692},[693,696,699],[33,694,695],[],[],[697],{"t":10,"c":698},"Ted Underwood",[700,33],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F04012428899328561750",{"t":10,"c":288},{"t":290,"c":703},[292,704],"\u003Ctime datetime=\"2016-09-13T16:26:35.312-04:00\"\u003E",{"t":10,"c":706},"Sep 2, 2016",{"t":290,"c":708},[292,298],{"t":25,"c":710},[711],{"t":10,"c":712},"Great conjecture. It’s driving me crazy that I don’t have time to test it. Totally doable.",{"t":25,"c":714},[715],{"t":10,"c":716},"For what it’s worth, my money is against the EPH. But the testable hypothesis is the thing!",{"t":328,"c":718},[292,330],{"t":234,"c":720},[266,721,725],[722,723,724],"even-if-you-know-how-certain-books-will",[],[],[726],{"t":10,"c":727},"1) “Even if you know how certain books will *…",{"t":25,"c":729},[730,740,741,744,745],{"t":30,"c":731},[732,735,738],[33,733,734],[],[],[736],{"t":10,"c":737},"Bill Benzon",[739,33],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F08360044945265178991",{"t":10,"c":288},{"t":290,"c":742},[292,743],"\u003Ctime datetime=\"2016-09-13T19:10:35.529-04:00\"\u003E",{"t":10,"c":706},{"t":290,"c":746},[292,298],{"t":748,"c":749},"OrderedList",[750,755],[3,751,753],{"t":752},"Decimal",{"t":754},"Period",[756],[757],{"t":758,"c":759},"Plain",[760],{"t":91,"c":761},[762,763],{"t":94},[764],{"t":10,"c":765},"Even if you know how certain books will *end*, that doesn’t mean that you’ll ever be able to predict the next two pages, which is what this is about. I think this distinction is crucially important and maybe underestimated.",{"t":25,"c":767},[768],{"t":10,"c":769},"YES.",{"t":748,"c":771},[772,775],[236,773,774],{"t":752},{"t":754},[776,789],[777],{"t":25,"c":778},[779,781,787],{"t":10,"c":780},"This kind of thing has come up in relation to music. As you know Leonard Meyer postulated expectation and surprise as the driving force behind emotion in music back in 1956. However, the ",{"t":91,"c":782},[783,784],{"t":94},[785],{"t":10,"c":786},"Surprise Symphony",{"t":10,"c":788}," will surprise you only once, or twice if you’re a bit dense. How is it that music is pleasurable even once we know a piece quite well? One recent answer is that, while there’s one mental module that does indeed know the musical future, there’s one or more others that do not. And it’s those modules that are being fooled. Alas, I don’t have a citation to this idea.",[790],{"t":25,"c":791},[792],{"t":10,"c":793},"Finally, this seems obliquely relevant:",{"t":25,"c":795},[796,798,804,806,810],{"t":10,"c":797},"Hays, D. G. (1973). ",{"t":91,"c":799},[800,801],{"t":94},[802],{"t":10,"c":803},"Language and Interpersonal Relationships.",{"t":10,"c":805}," ",{"t":164,"c":807},[808],{"t":10,"c":809},"Daedalus",{"t":10,"c":811}," 102(3): 203-216.",{"t":25,"c":813},[814],{"t":10,"c":815},"pp. 204-205:",{"t":25,"c":817},[818],{"t":10,"c":819},"The experiment strips conversation down to its barest essentials by depriving the subject of all language except for two pushbuttons and two lights, and by suggesting to him that he is attempting to reach an accord with a mere machine. We brought two students into our building through different doors and led them separately to adjoining rooms. We told each that he was working with a machine, and showed him lights and pushbuttons. Over and over again, at a signal, he would press one or the other of the two buttons, and then one of two lights would come on. If the light that appeared corresponded to the button he pressed, he was right; otherwise, wrong. The students faced identical displays, but their feedback was reversed: if student A pressed the red button, then a moment later student B would see the red light go on, and if student B pressed the red button, then student A would see the red light. On any trial, therefore, if the two students pressed matching buttons they would both be correct, and if they chose opposite buttons they would both be wrong.",{"t":25,"c":821},[822],{"t":10,"c":823},"We used a few pairs of RAND mathematicians; but they would quickly settle on one color, say red, and choose it every time. Always correct, they soon grew bored. The students began with difficulty, but after enough experience they would generally hit on something. . . . The students, although they were sometimes wrong, were rarely bored. They were busy figuring out the complex patterns of the machine.",{"t":25,"c":825},[826],{"t":10,"c":827},"But where did the patterns come from? Although neither student knew it, they arose out of the interaction of two students.",{"t":328,"c":829},[292,330],{"t":234,"c":831},[266,832,836],[833,834,835],"i-love-this-additional-turn-of-scott-es-null",[],[],[837],{"t":10,"c":838},"I love this additional turn of Scott E’s null …",{"t":25,"c":840},[841,851,852,855,857],{"t":30,"c":842},[843,846,849],[33,844,845],[],[],[847],{"t":10,"c":848},"Unknown",[850,33],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F00283384044749167124",{"t":10,"c":288},{"t":290,"c":853},[292,854],"\u003Ctime datetime=\"2016-09-16T11:38:10.796-04:00\"\u003E",{"t":10,"c":856},"Sep 5, 2016",{"t":290,"c":858},[292,298],{"t":25,"c":860},[861],{"t":10,"c":862},"I love this additional turn of Scott E’s null hypothesis. LeCarre makes a problematic example of the genre writer, though. In some work Scott and I have been doing we find the novels of LeC to be extreme outliers in a corpus of bestsellers; an algorithm that reliably distinguishes genre bestsellers from prizewinning literary fiction gets all the LeC novels wrong. – Jim",{"t":328,"c":864},[292,330],{"t":234,"c":866},[266,867,871],[868,869,870],"section",[],[],[],{"t":25,"c":873},[874,882,883,886,887],{"t":30,"c":875},[876,879,881],[33,877,878],[],[],[880],{"t":10,"c":848},[850,33],{"t":10,"c":288},{"t":290,"c":884},[292,885],"\u003Ctime datetime=\"2016-09-16T11:38:43.221-04:00\"\u003E",{"t":10,"c":856},{"t":290,"c":888},[292,298],{"t":25,"c":890},[891],{"t":10,"c":892},"This comment has been removed by a blog administrator.",{"t":328,"c":894},[292,330],{"t":234,"c":896},[266,897,901],[898,899,900],"there-are-a-few-other-intermediate-tests-someone-s",[],[],[902],{"t":10,"c":903},"There are a few other intermediate tests someone s…",{"t":25,"c":905},[906,914,915,918,919],{"t":30,"c":907},[908,911,913],[33,909,910],[],[],[912],{"t":10,"c":425},[427,33],{"t":10,"c":288},{"t":290,"c":916},[292,917],"\u003Ctime datetime=\"2016-09-16T16:47:21.663-04:00\"\u003E",{"t":10,"c":856},{"t":290,"c":920},[292,298],{"t":25,"c":922},[923],{"t":10,"c":924},"There are a few other intermediate tests someone should run here too.",{"t":25,"c":926},[927],{"t":10,"c":928},"1. Do the patterns look the same if you take random subsets of stories as if you take full stories? (If so, stories are either random noise or some sort of fractal structure; the latter would be weirdly interesting too.)",{"t":25,"c":930},[931],{"t":10,"c":932},"2. How accurately can a machine learning algorithm predict the next sentiment in a story? What information (ie, what time horizon of previous sentiments) makes it the best at predicting?",{"t":25,"c":934},[935],{"t":10,"c":936},"These two don’t even need experiments.",{"t":328,"c":938},[292,330],{"t":234,"c":940},[266,941,945],[942,943,944],"the-music-analogy-remains-really-interesting.-of-c",[],[],[946],{"t":10,"c":947},"The music analogy remains really interesting. Of c…",{"t":25,"c":949},[950,958,959,962,963],{"t":30,"c":951},[952,955,957],[33,953,954],[],[],[956],{"t":10,"c":425},[427,33],{"t":10,"c":288},{"t":290,"c":960},[292,961],"\u003Ctime datetime=\"2016-09-16T16:53:22.449-04:00\"\u003E",{"t":10,"c":856},{"t":290,"c":964},[292,298],{"t":25,"c":966},[967],{"t":10,"c":968},"The music analogy remains really interesting. Of course in music you do know most of what’s going to happen, but some individual part is usually elusive. Maybe.",{"t":25,"c":970},[971],{"t":10,"c":972},"That brings up yet another similar experiment, Claude Shannon’s experiments to predict the next letter in English. He, of course, found heavy redundancy in English-language text, not a random walk. This question about emotional valence is several levels out from the resolution Shannon was looking at, and I can’t quite wrap my head around the implications. But one possibility is that even some predictability of emotions in the short term (contrary my comment to Ted above) doesn’t necessarily imply that the long term isn’t at least somewhat pseudo-random.",{"t":328,"c":974},[292,330],{"t":234,"c":976},[266,977,981],[978,979,980],"concerning-music-im-a-jazz-musician-and-a-p",[],[],[982],{"t":10,"c":983},"Concerning music, I’m a jazz musician, and a p…",{"t":25,"c":985},[986,994,995,998,999],{"t":30,"c":987},[988,991,993],[33,989,990],[],[],[992],{"t":10,"c":737},[739,33],{"t":10,"c":288},{"t":290,"c":996},[292,997],"\u003Ctime datetime=\"2016-09-16T23:31:14.814-04:00\"\u003E",{"t":10,"c":856},{"t":290,"c":1000},[292,298],{"t":25,"c":1002},[1003],{"t":10,"c":1004},"Concerning music, I’m a jazz musician, and a pretty good one, too, having opened for Dizzy Gillespie on one occasion and BB King on another. That is to say, my experience is not that of a semi-competent dabbler.",{"t":25,"c":1006},[1007,1009,1015,1017],{"t":10,"c":1008},"When I’m soloing, then, I am just making it up, but I don’t necessarily know what’s coming next despite the fact that I’m the one who determines it. Sometimes it just gets away from you; what comes out isn’t what you’d been intending. That’s when things get really interesting. Now you’ve got to get back on track so you can pretend that the ",{"t":91,"c":1010},[1011,1012],{"t":589},[1013],{"t":10,"c":1014},"mistake",{"t":10,"c":1016}," wasn’t a mistake at all, just a particularly clever feint. Hence the saying, ",{"t":91,"c":1018},[1019,1020],{"t":94},[1021],{"t":10,"c":1022},"there are no bad notes, only bad resolutions.",{"t":25,"c":1024},[1025],{"t":10,"c":1026},"Note however that if you listen to the older guys (Louis Armstrong for example) play the same tune on different recordings, you realize that they aren’t making their solo up from scratch each time. Rather, on a given tune they’ve got an approach worked out and they follow it each time they play the tune, with only minor variations. It’s not improvisation so much as it is un-notated composition. The idea of improvising a new solo each and every time seems to have evolved with the bebop era in the early to mid-1940s.",{"t":328,"c":1028},[292,330],{"t":234,"c":1030},[266,1031,1035],[1032,1033,1034],"interesting.-i-assume-that-youre-classifying",[],[],[1036],{"t":10,"c":1037},"Interesting. I assume that you’re classifying …",{"t":25,"c":1039},[1040,1048,1049,1052,1053],{"t":30,"c":1041},[1042,1045,1047],[33,1043,1044],[],[],[1046],{"t":10,"c":425},[427,33],{"t":10,"c":288},{"t":290,"c":1050},[292,1051],"\u003Ctime datetime=\"2016-09-20T10:16:37.510-04:00\"\u003E",{"t":10,"c":706},{"t":290,"c":1054},[292,298],{"t":25,"c":1056},[1057],{"t":10,"c":1058},"Interesting. I assume that you’re classifying on vocabulary, so it’s *possible* that LeCarre books have a literary prizewinner’s diction but a thriller’s structure. (That sounds like back-jacket copy, doesn’t it?). But for me to just assert that is kind of begging the question here.",{"t":25,"c":1060},[1061],{"t":10,"c":1062},"I guess another way of saying it is: do plots become more predictable in genres where they’re of primary importance? I haven’t really read enough true pulps to say.",{"t":328,"c":1064},[292,330],{"t":234,"c":1066},[266,1067,1071],[1068,1069,1070],"dont-tell-me-the-book-my-guess-for-the-story",[],[],[1072],{"t":10,"c":1073},"Don’t tell me the book: my guess for the story…",{"t":25,"c":1075},[1076,1085,1086,1089,1091],{"t":30,"c":1077},[1078,1081,1083],[33,1079,1080],[],[],[1082],{"t":10,"c":848},[1084,33],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F07956598848315576017",{"t":10,"c":288},{"t":290,"c":1087},[292,1088],"\u003Ctime datetime=\"2016-09-28T19:15:28.158-04:00\"\u003E",{"t":10,"c":1090},"Sep 3, 2016",{"t":290,"c":1092},[292,298],{"t":25,"c":1094},[1095,1097,1103,1105,1111,1113],{"t":10,"c":1096},"Don’t tell me the book: my guess for the story becoming more positive or negative in the next two pages (or five) is ",{"t":91,"c":1098},[1099,1100],{"t":589},[1101],{"t":10,"c":1102},"neither",{"t":10,"c":1104},". If the goal is ",{"t":91,"c":1106},[1107,1108],{"t":589},[1109],{"t":10,"c":1110},"what happens",{"t":10,"c":1112}," as you discuss later, my guess is ",{"t":91,"c":1114},[1115,1116],{"t":94},[1117],{"t":10,"c":1118},"same thing that is happening now.",{"t":25,"c":1120},[1121,1123,1129],{"t":10,"c":1122},"However, I’m not convinced though that an ",{"t":91,"c":1124},[1125,1126],{"t":94},[1127],{"t":10,"c":1128},"efficient plot",{"t":10,"c":1130}," is meaningful in the way you describe it. What would a perfect EPH book look like? If the criteria is that you can’t predict what will happen in two or five pages, then that’s a book that always zigs when others zag. That’s exhausting and meandering, and I wouldn’t expect that authors optimize for that in good fiction in any way comparable to how the stock market optimizes.",{"t":25,"c":1132},[1133],{"t":10,"c":1134},"I also have a few clarifying questions.",{"t":25,"c":1136},[1137],{"t":10,"c":1138},"How do we confirm the EPH? Does it assume the ideal reader or a 10-year old reader? Where do algorithms factor in? If an algorithm can predict the next two pages but a person can’t, does the EPH hold or not?",{"t":25,"c":1140},[1141],{"t":10,"c":1142},"What about probabilistic predictions? How much certainty do you have to assign to your guess? If a person knows when to not be confident in their guess, does that speak to the efficiency or predictability of the plot?",{"t":328,"c":1144},[292,330],{"t":234,"c":1146},[266,1147,1151],[1148,1149,1150],"my-guess-for-the-story-becoming-more-positive",[],[],[1152],{"t":10,"c":1153},"\u003E my guess for the story becoming more positive…",{"t":25,"c":1155},[1156,1164,1165,1168,1169],{"t":30,"c":1157},[1158,1161,1163],[33,1159,1160],[],[],[1162],{"t":10,"c":425},[427,33],{"t":10,"c":288},{"t":290,"c":1166},[292,1167],"\u003Ctime datetime=\"2016-09-28T22:10:34.906-04:00\"\u003E",{"t":10,"c":1090},{"t":290,"c":1170},[292,298],{"t":25,"c":1172},[1173,1175,1180],{"t":10,"c":1174},"\u003E my guess for the story becoming more positive or negative in the next two pages (or five) is ",{"t":91,"c":1176},[1177,1178],{"t":589},[1179],{"t":10,"c":1102},{"t":10,"c":253},{"t":25,"c":1182},[1183],{"t":10,"c":1184},"Sure–but that’s the a guess consistent with the plot being Brownian noise. The intuition literary scholars seem to have about plot direction is that it’s determined by genre, and you could beat Brownian noise on the margin by knowing your plot.",{"t":25,"c":1186},[1187],{"t":10,"c":1188},"\u003E What would a perfect EPH book look like? If the criteria is that you can’t predict what will happen in two or five pages, then that’s a book that always zigs when others zag.",{"t":25,"c":1190},[1191],{"t":10,"c":1192},"If you take the EPH seriously (which, yes, is difficult to do with a straight face) there is no such thing as a single EPH book; it’s a general equilibrium where, from any given point, half of all plots zig and half zag. Neither of those moves is necessarily exhausting. It’s just that half the time the butler did it, and half the time someone else did it.",{"t":25,"c":1194},[1195],{"t":10,"c":1196},"\u003E How do we confirm the EPH? Does it assume the ideal reader or a 10-year old reader? Where do algorithms factor in? If an algorithm can predict the next two pages but a person can’t, does the EPH hold or not?",{"t":25,"c":1198},[1199,1201,1207,1209,1215,1217,1223],{"t":10,"c":1200},"As a good hypothesis, I don’t think it could be ",{"t":91,"c":1202},[1203,1204],{"t":94},[1205],{"t":10,"c":1206},"proven",{"t":10,"c":1208},"; but it should be easy to falsify across any given metric. (I hedge on metric because although the original domain is ",{"t":91,"c":1210},[1211,1212],{"t":94},[1213],{"t":10,"c":1214},"sentiment,",{"t":10,"c":1216}," I don’t really believe that’s a super proxy for ",{"t":91,"c":1218},[1219,1220],{"t":94},[1221],{"t":10,"c":1222},"plot.",{"t":10,"c":1224},") To falsify in any sense, show that plot arcs on that metric *are* predictable in the short term. This should be easy; but the nutty thing that Enderle is finding is that it isn’t as easy as it seems. (I suspect, though, that Matt Jockers has some data sitting around that could kill this thing dead. It may even be in the new book, which I haven’t read yet.)",{"t":25,"c":1226},[1227],{"t":10,"c":1228},"To extinguish the EPH as a live concern, you could also come up with a more plausible causal explanation than the EPH of why plots aren’t as predictable as you’d think.",{"t":25,"c":1230},[1231,1233,1239],{"t":10,"c":1232},"The reader it assumes is definitely a weak point. ",{"t":91,"c":1234},[1235,1236],{"t":94},[1237],{"t":10,"c":1238},"The intended audience of the book,",{"t":10,"c":1240}," maybe?In theory, an algorithm might be able to exceed human performance. But since this is the sort of task that semantic tasks are pretty bad at, I’d probably take it. Probabilistic prediction is fine; in fact, I suspect the best way to score this would be using logits.",{"t":328,"c":1242},[292,330],{"t":234,"c":1244},[266,1245,1249],[1246,1247,1248],"ah-yes-i-removed-it-earlier-because-i-was-getting",[],[],[1250],{"t":10,"c":1251},"Ah yes, I removed it earlier because I was getting…",{"t":25,"c":1253},[1254,1262,1263,1266,1268],{"t":30,"c":1255},[1256,1259,1261],[33,1257,1258],[],[],[1260],{"t":10,"c":848},[1084,33],{"t":10,"c":288},{"t":290,"c":1264},[292,1265],"\u003Ctime datetime=\"2016-09-29T12:44:43.539-04:00\"\u003E",{"t":10,"c":1267},"Sep 4, 2016",{"t":290,"c":1269},[292,298],{"t":25,"c":1271},[1272],{"t":10,"c":1273},"Ah yes, I removed it earlier because I was getting long-winded, but my read was that you intended for half zigs and half zags: where you don’t know if the typical or atypical will happen. I meant that the stated criteria might not necessarily reflect that intent, and might favour a path of all left-turns. Maybe it does, hard to unkink the various possible interpretations in my head.",{"t":328,"c":1275},[292,330],{"created":1277,"edited":1277,"filename":1278,"title":18,"date":1279,"draft":14,"url":22},"2023-02-10T22:07:18.434Z","the-efficient-plots-hypothesis","2016-09-09T17:07:00.002Z"],"uses":{"params":["slug"]}}]}