{"type":"data","nodes":[{"type":"data","data":[null],"uses":{}},{"type":"data","data":[{"document":1,"metadata":911},{"pandoc-api-version":2,"meta":5,"blocks":30},[3,4,3],1,22,{"date":6,"draft":12,"tags":15,"title":22,"url":26},{"t":7,"c":8},"MetaInlines",[9],{"t":10,"c":11},"Str","2014-03-31T14:51:00.003-04:00",{"t":13,"c":14},"MetaBool",false,{"t":16,"c":17},"MetaList",[18],{"t":7,"c":19},[20],{"t":10,"c":21},"Ships",{"t":7,"c":23},[24],{"t":10,"c":25},"Shipping maps and how states see",{"t":7,"c":27},[28],{"t":10,"c":29},"\u002F2014\u002F03\u002Fshipping-maps-and-how-states-see.html",[31,72,84,100,104,122,126,130,141,158,162,178,182,186,203,207,211,227,231,248,252,264,276,293,297,320,324,348,372,383,393,403,428,432,456,460,464,473,492,496,500,502,511,528,532,534,543,563,567,569,578,596,600,602,611,628,656,658,667,684,700,702,711,730,734,736,745,764,768,770,779,797,804,806,815,832,836,876,878,887,905,909],{"t":32,"c":33},"Para",[34,36,48,50,60,62,70],{"t":10,"c":35},"A map I put up a year and a half ago went viral this winter; it shows the paths taken by ships in the US Maury collection of the ",{"t":37,"c":38},"Link",[39,43,46],[40,41,42],"",[],[],[44],{"t":10,"c":45},"ICOADS",[47,40],"http:\u002F\u002Ficoads.noaa.gov\u002F",{"t":10,"c":49}," database. I’ve had several requests for higher-quality versions: I had some up already, but I ",{"t":37,"c":51},[52,55,58],[40,53,54],[],[],[56],{"t":10,"c":57},"just put up on Flickr a basically comparable high resolution version",[59,40],"https:\u002F\u002Fwww.flickr.com\u002Fphotos\u002F10052187@N05\u002F13516638735\u002F",{"t":10,"c":61},". US Maury is ",{"t":63,"c":64},"Quoted",[65,67],{"t":66},"DoubleQuote",[68],{"t":10,"c":69},"Deck 701",{"t":10,"c":71}," in the ICOADS collection: I also put up charts for all of the other decks with fewer than 3,000,000 points. You can page through them below, or download the high quality versions from Flickr directly. (At the time of posting, you have to click on the three dots to get through to the summaries).",{"t":32,"c":73},[74,76,82],{"t":10,"c":75},"I’ve also had a lot of questions about modern day equivalents to that chart. This, it turns out, is an absolutely fascinating question, because it forces a set of questions about what the Maury chart actually shows. Of course, on the surface, it seems to show 19th century shipping routes: that’s the primary reason it’s interesting. But it’s an obviously incomplete, obviously biased, and obviously fragmentary view of those routes. It’s a relatively complete view, on the other hand, of something more restricted but nearly as interesting: the way that the 19th century American state was able to see and take measure of the world. No one, today, needs to be told that patterns of state surveillance, data collection, and storage are immensely important. Charts like these provide an interesting and important locus for seeing how states ",{"t":63,"c":77},[78,79],{"t":66},[80],{"t":10,"c":81},"saw,",{"t":10,"c":83}," to commandeer a phrase from James Scott.",{"t":32,"c":85},[86,88,98],{"t":10,"c":87},"So I want to explore a couple of these decks as snapshots of state knowledge that show different periods in the ways states collected knowledge as data. In my earlier pieces on shipping, I argued that ",{"t":37,"c":89},[90,93,96],[40,91,92],[],[],[94],{"t":10,"c":95},"data narratives should eschew individual stories to describe systems and collectives",[97,40],"http:\u002F\u002Fsappingattention.blogspot.com\u002F2012\u002F11\u002Fwhere-are-individuals-in-data-driven.html",{"t":10,"c":99},". States are one of the most important of these collectives, and they have a way of knowing that is at once far more detailed and far more impoverished than the bureaucrats who collect for them. These data snapshots are fascinating and revealing snapshots of how the state used to and continues to pull in information from the world. (More practically, this post is also a bit of mulling over some questions for talks I’ll be giving at the University of Nebraska on April 11 and the University of Georgia on April 22st–if you’re in either area, come on down. Some of the unanswered questions may be filled in by then.)",{"t":32,"c":101},[102],{"t":10,"c":103},"So: what’s the modern analogue to the Maury map I made? The government collection from which I pulled the Maury data almost entirely consists of data from the 20th century. So rather easily I can pull out another deck that looks somewhat similar: say, the US Natl. Cntrs. for Environ. Pred. (NCEP) Ship Data, deck 892, collected between 1980 and 1997. The easiest thing to do would be just slap it up, claim it shows modern patterns of shipping (the St. Lawrence seaway! The Suez canal! The steam engine! etc.), and declare victory. And indeed I’m going to do something similar eventually with merchant marine data from the first half of the twentieth century.",{"t":32,"c":105},[106],{"t":37,"c":107},[108,111,121],[40,109,110],[],[],[112],{"t":113,"c":114},"Image",[115,118,119],[40,116,117],[],[],[],[120,40],"http:\u002F\u002F3.bp.blogspot.com\u002F-SLBgT2O7Ryo\u002FUzlx3UBoMWI\u002FAAAAAAAAEVQ\u002FvtL_3NEjKYI\u002Fs1600\u002F892.png",[120,40],{"t":32,"c":123},[124],{"t":10,"c":125},"Deck 892: 1980-1997",{"t":32,"c":127},[128],{"t":10,"c":129},"But to make an analogue, we have to really understand what deck 701 is. It’s not a transparent representation of American shipping; rather, it’s a concerted government effort to collect data opportunistically on the areas where the least exists. Take all those Pacific routes from the Maury collection. They are, as I wrote earlier, whaling voyages. Whaling voyages, in fact, comprise about a quarter of the US Maury collection. But they were not, I feel fairly confident, a quarter of all American ships. Matthew Maury, rather, intentionally collected shipping logs from whaling vessels because he knew they were traveling to exotic locations. (The US navy, at least as far as I can tell from these logs, did nothing nearly so interesting). So the way the 19th century American state saw the map of the world was shaped by the agents at its command. (There’s a great deal of academic literature on territoriality, governmentality, and the like along these lines; history of science, history of cartography, etc.)",{"t":32,"c":131},[132,134],{"t":10,"c":133},"So rather than deck 892, a better analogue to the Maury data might be deck 720, from the ",{"t":63,"c":135},[136,138],{"t":137},"SingleQuote",[139],{"t":10,"c":140},"Deutscher Wetterdienst (DWD) Marine Met. Archive.",{"t":32,"c":142},[143],{"t":37,"c":144},[145,148,157],[40,146,147],[],[],[149],{"t":113,"c":150},[151,154,155],[40,152,153],[],[],[],[156,40],"http:\u002F\u002F2.bp.blogspot.com\u002F-JbuVSR8XGak\u002FUzlyOibSUjI\u002FAAAAAAAAEVg\u002FKaGkRYY2pjA\u002Fs1600\u002F720.png",[156,40],{"t":32,"c":159},[160],{"t":10,"c":161},"Deck 720, 1876-1914",{"t":32,"c":163},[164,166,176],{"t":10,"c":165},"There is a massive empty rectangle in the middle where record collection was deemed unnecessary; probably records were not collected at all, though it’s possible they were keyed in and then the punch cards corresponding to those regions was discarded. Where the state surveyed was defined by its areas of lack of knowledge. But there are other features that show, instead, limited capacity for vision and storage. The lines in the Pacific are more gridded than in the 701 chart; that’s because the data was entered onto punch cards, and rather than store out all two or three decimal points, the recorders only kept zero or one for latitude and longitude. The strange white bands running out from Texas south and west are mysterious to me. (See ",{"t":37,"c":167},[168,171,174],[40,169,170],[],[],[172],{"t":10,"c":173},"some more details and links to yet more on how bands like these emerged",[175,40],"http:\u002F\u002Fsappingattention.blogspot.com\u002F2012\u002F10\u002Flogbooks-and-long-history-of.html",{"t":10,"c":177},").",{"t":32,"c":179},[180],{"t":10,"c":181},"Of course, these initial passes didn’t yield all the data about the ocean imaginable.  And the piecemeal practice of collecting data through accidents of commercial shipping has obvious drawbacks. This still does not quite represent the modern era of data.",{"t":32,"c":183},[184],{"t":10,"c":185},"A pure drive for data collection to truly meet state needs would not rely on the accidents of commercial traffic. But what do the state’s actual priorities look like? Behold Deck 735: Russian Research Vessel (R\u002FV) Digitisation. The age-of-sail loops from the Maury collection and the commercial beelines from the twentieth show the state vision mediated through agents of commerce who are barely responsive to central dictates. Deck 735, on the other hand, mostly collected in the late Soviet period, shows state data collection unmediated by the needs of commerce.",{"t":32,"c":187},[188],{"t":37,"c":189},[190,193,202],[40,191,192],[],[],[194],{"t":113,"c":195},[196,199,200],[40,197,198],[],[],[],[201,40],"http:\u002F\u002F2.bp.blogspot.com\u002F-I8cWLLHLQ8U\u002FUzlxdyq_dJI\u002FAAAAAAAAEU4\u002Fbpe4OLN2ueE\u002Fs1600\u002F735.png",[201,40],{"t":32,"c":204},[205],{"t":10,"c":206},"Deck 735: 1936-2000",{"t":32,"c":208},[209],{"t":10,"c":210},"At first glance, the most remarkable feature is the grid: commercial vessels do not trace latitudes and longitudes, but the Soviet research program led to intense tracking over straight lines in unpopulated areas of all the oceans.",{"t":32,"c":212},[213,215,225],{"t":10,"c":214},"But they do not survey all areas equally. Each of the major ports–Murmansk, Petersburg, Sevastopol, Vladivostok–is a focus for much more intensive local exploration. But other areas as well–the US east coast, several areas of the North Atlantic, the Australian bight–fall under the state’s gaze as well, out of interest or (as in the case, I suspect, of Cuba) logistical necessity. (A note to myself: they’re not sailing to Havana–what is the port on the south? Or diplomatic provocation–they seem to be sailing to Cienfuegos rather than Havana, ",{"t":37,"c":216},[217,220,223],[40,218,219],[],[],[221],{"t":10,"c":222},"where the USSR hoped to build a submarine base",[224,40],"http:\u002F\u002Ft.co\u002FLo8ZCWHUpv",{"t":10,"c":226},")",{"t":32,"c":228},[229],{"t":10,"c":230},"There are limits, as well, on the ability of the state to see. One sharp set of lines seems to sketch out the west coast of South America; but on closer inspection, the ships are carefully keeping some number of miles off the coast. (Q: To stay in international waters, presumably? Something to do with fishing areas?)",{"t":32,"c":232},[233],{"t":37,"c":234},[235,238,247],[40,236,237],[],[],[239],{"t":113,"c":240},[241,244,245],[40,242,243],[],[],[],[246,40],"http:\u002F\u002F1.bp.blogspot.com\u002F--XVSnEZ49rY\u002FUzl_eQNInGI\u002FAAAAAAAAEVw\u002F_MND6pFoaVk\u002Fs1600\u002F735-closeup.png",[246,40],{"t":32,"c":249},[250],{"t":10,"c":251},"This is the only example I have of such powerfully gridded examination; I suspect, though, that it’s less a unique feature of some Communistic stateview and more one the random leaks out of state vaults in the period after the collapse. Somewhere there are probably comparable American, or British, or German data as well.",{"t":32,"c":253},[254,256,262],{"t":10,"c":255},"But however purely the Soviets may stand in for a modern instrumental attitude towards data, it is not an end point. Contemporary data collection is more fluid, sensor dependent, and, well, postmodern than the gridded visions of the 20th century state. Deck 715 is a beautiful early harbinger of what’s coming; ",{"t":63,"c":257},[258,259],{"t":137},[260],{"t":10,"c":261},"German Deep Drifter Data (via ISDM; originally from IfM\u002FUniv. Kiel)",{"t":10,"c":263},", collected in the 1980s and 1990s.",{"t":32,"c":265},[266],{"t":37,"c":267},[268,271,274],[40,269,270],[],[],[272],{"t":273},"LineBreak",[275,40],"http:\u002F\u002F1.bp.blogspot.com\u002F-ofwgBMNNMVs\u002FUzlxoHSHGMI\u002FAAAAAAAAEVA\u002Fce-EC5D1t-w\u002Fs1600\u002F706.png",{"t":32,"c":277},[278],{"t":37,"c":279},[280,283,292],[40,281,282],[],[],[284],{"t":113,"c":285},[286,289,290],[40,287,288],[],[],[],[291,40],"http:\u002F\u002F3.bp.blogspot.com\u002F-Jc5qCRyf_Gw\u002FUzlx91abN6I\u002FAAAAAAAAEVY\u002FqmzLv3q1ubg\u002Fs1600\u002F715.png",[291,40],{"t":32,"c":294},[295],{"t":10,"c":296},"Deck 715",{"t":32,"c":298},[299,301,311,313,318],{"t":10,"c":300},"The outlines of the Atlantic are just barely visible (the coast of South America is best defined, for those who see nothing) because locomotion has been removed from ships altogether and ",{"t":37,"c":302},[303,306,309],[40,304,305],[],[],[307],{"t":10,"c":308},"left in the hands of the currents",[310,40],"http:\u002F\u002Fwww.bsh.de\u002Fen\u002FMarine_data\u002FObservations\u002FMarine_physical_data\u002Fdrifter.jsp",{"t":10,"c":312},". All the previous versions included observations made by human beings at sea; the drifters are autonomous, mechanical devices that circle around for their natural lives before disappearing. The gridded logic of the central state appears gone. But it’s not, entirely: in video form, it appears as a mess of swirls, but the ",{"t":314,"c":315},"Emph",[316],{"t":10,"c":317},"insertion",{"t":10,"c":319}," of the capsules into the ocean frequently takes place on a rigidly gridded basis. It’s mesmerizing, and a sort of beautiful visual metaphor for the subtle dispersion of state power in postmodern societies. (You’ll probably have to come to one of those talks to see that video, at least for now). But that rigidity quickly becomes invisible; forms of observation are more flexible, more spontaneous, less dependent on the logic of central observation.",{"t":32,"c":321},[322],{"t":10,"c":323},"So: what does this have to do with larger logics of state power and surveillance? (All remaining non-academics might want to stop reading now, in case that’s not already clear.) A straightforward three part division suggests some interesting correspondences.",{"t":325,"c":326},"OrderedList",[327,332],[3,328,330],{"t":329},"Decimal",{"t":331},"Period",[333,338,343],[334],{"t":32,"c":335},[336],{"t":10,"c":337},"Weak state capacity: Opportunistic accumulation on top of existing social groups.",[339],{"t":32,"c":340},[341],{"t":10,"c":342},"Strong state capacity: relentlessly logical, unresponsive systems of omission and collection.",[344],{"t":32,"c":345},[346],{"t":10,"c":347},"Invisible but omnipresent; saturation of information space through soft forms of subtle collection, with state-imposed grids yielding to on-the-ground conditions to collect more omnipresent data.",{"t":32,"c":349},[350,352,358,360,370],{"t":10,"c":351},"A lot about it looks like a Foucault story about the invisibility of power; but the timeframe is completely off. (The Soviet shipping route looks a lot like the gardens at Versailles.) I feel like there’s an interesting affinity to certain species of leftist political economy; you could call the last two images ",{"t":63,"c":353},[354,355],{"t":66},[356],{"t":10,"c":357},"From Fordism to Flexible Accumulation",{"t":10,"c":359}," (after ",{"t":37,"c":361},[362,365,368],[40,363,364],[],[],[366],{"t":10,"c":367},"David Harvey",[369,40],"http:\u002F\u002Fwww.amazon.com\u002FThe-Condition-Postmodernity-Enquiry-Cultural\u002Fdp\u002F0631162941",{"t":10,"c":371},") and not lose much. But Harvey’s writing about the economy more than the state; one could do this same sort of analysis on corporate records, but they tend to be more obscure and intractable than government sources. It seems like a fruitful question, at least.",{"t":373,"c":374},"Header",[375,376,380],2,[377,378,379],"finally-an-unplaced-point-on-data-visualization.-it-strikes-me-that-ethnographic-accounts-of-state-function-and-disfunction-have-much-to-gain-from-seeing-as-clearly-as-possible-what-the-state-itself-saw-rather-than-merely-its-bureaucrats.-at-the-time-much-of-this-data-was-collected-that-was-impossible-whole-bureaucracies-were-necessary-to-make-a-map.-but-visualization-offers-a-much-more-honest-way-of-seeing-like-a-state-with-its-breadth-and-its-one-dimensionality-than-trying-to-phrase-things-into-human-narratives.-without-the-means-to-process-large-scale-data-as-efficiently-as-the-late-19th-century-american-state-it-is-very-hard-to-imagine-the-world-as-the-state-saw-it-using-such-tools-seems-to-me-essential-to-properly-understanding-its-operations.",[],[],[381],{"t":10,"c":382},"Finally, an unplaced point on data visualization. It strikes me that ethnographic accounts of state function and disfunction have much to gain from seeing, as clearly as possible, what the state itself saw rather than merely its bureaucrats. At the time much of this data was collected, that was impossible; whole bureaucracies were necessary to make a map. But visualization offers a much more honest way of seeing like a state, with its breadth and its one-dimensionality, than trying to phrase things into human narratives. Without the means to process large-scale data as efficiently as the late-19th century American state,  it is very hard to imagine the world as the state saw it; using such tools seems to me essential to properly understanding its operations.",{"t":373,"c":384},[385,386,390],3,[387,388,389],"comments",[],[],[391],{"t":10,"c":392},"Comments:",{"t":373,"c":394},[395,396,400],4,[397,398,399],"great-post-ben-im-a-bit-confused-by-the-id",[],[],[401],{"t":10,"c":402},"Great post, Ben! I’m a bit confused by the id…",{"t":32,"c":404},[405,416,418,423,425],{"t":37,"c":406},[407,410,413],[40,408,409],[],[],[411],{"t":10,"c":412},"Cameron Blevins",[414,415],"http:\u002F\u002Fcameronblevins.org","noreply@blogger.com",{"t":10,"c":417}," - ",{"t":419,"c":420},"RawInline",[421,422],"html","\u003Ctime datetime=\"2014-03-31T17:00:44.558-04:00\"\u003E",{"t":10,"c":424},"Mar 1, 2014",{"t":419,"c":426},[421,427],"\u003C\u002Ftime\u003E",{"t":32,"c":429},[430],{"t":10,"c":431},"Great post, Ben!",{"t":32,"c":433},[434,436,442,444,448,450,454],{"t":10,"c":435},"I’m a bit confused by the idea of ",{"t":63,"c":437},[438,439],{"t":66},[440],{"t":10,"c":441},"what the state itself saw rather than merely its bureaucrats.",{"t":10,"c":443}," I appreciate the way this approach get at what what the state ",{"t":314,"c":445},[446],{"t":10,"c":447},"tried",{"t":10,"c":449}," to see, but there’s a still pretty big gap between that and what the state ",{"t":314,"c":451},[452],{"t":10,"c":453},"actually",{"t":10,"c":455}," saw or was able to see. Your visualizations are incredibly data-rich and beautiful articulations of how different kinds of space was produced by maritime movement, but I just don’t see as strong a link between them and the maps or other kinds of spatial representations used by states which, as you note, would have needed entire bureaucracies just to make a map. Or maybe there were examples of analogous maps? Either way, wonderful work!",{"t":32,"c":457},[458],{"t":10,"c":459},"-Cameron",{"t":461,"c":462},"RawBlock",[421,463],"\u003Chr \u002F\u003E",{"t":373,"c":465},[395,466,470],[467,468,469],"youre-right-i-think-im-slightly-conflat",[],[],[471],{"t":10,"c":472},"You’re right, I think I’m slightly conflat…",{"t":32,"c":474},[475,485,486,489,490],{"t":37,"c":476},[477,480,483],[40,478,479],[],[],[481],{"t":10,"c":482},"Ben",[484,40],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F04856020368342677253",{"t":10,"c":417},{"t":419,"c":487},[421,488],"\u003Ctime datetime=\"2014-03-31T18:21:02.111-04:00\"\u003E",{"t":10,"c":424},{"t":419,"c":491},[421,427],{"t":32,"c":493},[494],{"t":10,"c":495},"You’re right, I think I’m slightly conflating two questions here; first how, and second what states see. Your question is more, I think (?) about what they see; that is, the knowledge that escapes from functionaries into data. I think one could argue that these visualizations do that to some degree ; actually, I have a paper proposal in somewhere on data revisualization that will be precisely about that (and which I actually think I may use your post office data to build one of the charts for.) Maury did publish charts that look a lot like these, though with more detail and context.",{"t":32,"c":497},[498],{"t":10,"c":499},"But here I think I should have stuck to *how* the state saw, because these are really about mechanics of vision. The analogy might be to those eyeball tracking devices that show where and how an individual reads a page without necessarily showing what they actually saw ; that gets at questions of mechanics as well as content (ie, this is more than just where they saw) without being about content exactly. (because in all these cases the what is actually wind speeds, currents, temperature, etc., not ship tracks in themselves.",{"t":461,"c":501},[421,463],{"t":373,"c":503},[395,504,508],[505,506,507],"and-come-to-think-of-it-as-a-note-to-myself-the",[],[],[509],{"t":10,"c":510},"And come to think of it as a note to myself , the …",{"t":32,"c":512},[513,521,522,525,526],{"t":37,"c":514},[515,518,520],[40,516,517],[],[],[519],{"t":10,"c":482},[484,40],{"t":10,"c":417},{"t":419,"c":523},[421,524],"\u003Ctime datetime=\"2014-03-31T18:26:29.266-04:00\"\u003E",{"t":10,"c":424},{"t":419,"c":527},[421,427],{"t":32,"c":529},[530],{"t":10,"c":531},"And come to think of it as a note to myself , the Soviets also used ship trail visualizations in the two huge 1980s atlases the Atlas arctica and Antarctica to show the paths of research vessels that are also in this collection ; the first volume of the Marine Atlas (1950-something ) doesn’t have them, but I should check the other two volumes and the1970s successor volumes",{"t":461,"c":533},[421,463],{"t":373,"c":535},[395,536,540],[537,538,539],"these-are-really-nice.-how-did-you-perform-the-vis",[],[],[541],{"t":10,"c":542},"These are really nice. How did you perform the vis…",{"t":32,"c":544},[545,555,556,559,561],{"t":37,"c":546},[547,550,553],[40,548,549],[],[],[551],{"t":10,"c":552},"Unknown",[554,40],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F15698968558999435841",{"t":10,"c":417},{"t":419,"c":557},[421,558],"\u003Ctime datetime=\"2014-04-01T06:53:26.577-04:00\"\u003E",{"t":10,"c":560},"Apr 2, 2014",{"t":419,"c":562},[421,427],{"t":32,"c":564},[565],{"t":10,"c":566},"These are really nice. How did you perform the visualization?",{"t":461,"c":568},[421,463],{"t":373,"c":570},[395,571,575],[572,573,574],"mechanics-of-vision-makes-a-lot-of-sense-and-i-li",[],[],[576],{"t":10,"c":577},"Mechanics of vision makes a lot of sense, and I li…",{"t":32,"c":579},[580,589,590,593,594],{"t":37,"c":581},[582,585,588],[40,583,584],[],[],[586],{"t":10,"c":587},"Cameron Bleivns",[414,40],{"t":10,"c":417},{"t":419,"c":591},[421,592],"\u003Ctime datetime=\"2014-04-01T09:02:41.333-04:00\"\u003E",{"t":10,"c":560},{"t":419,"c":595},[421,427],{"t":32,"c":597},[598],{"t":10,"c":599},"Mechanics of vision makes a lot of sense, and I like the analogy to eyeball tracking devices. There seems like such a wide continuum between gathering information and making it legible. I’d love to see the Maury charts - is there a link to them anywhere?",{"t":461,"c":601},[421,463],{"t":373,"c":603},[395,604,608],[605,606,607],"here-are-a-couple-maps",[],[],[609],{"t":10,"c":610},"Here are a couple maps:",{"t":32,"c":612},[613,621,622,625,626],{"t":37,"c":614},[615,618,620],[40,616,617],[],[],[619],{"t":10,"c":482},[484,40],{"t":10,"c":417},{"t":419,"c":623},[421,624],"\u003Ctime datetime=\"2014-04-01T09:38:01.157-04:00\"\u003E",{"t":10,"c":560},{"t":419,"c":627},[421,427],{"t":32,"c":629},[630,632,642,644,654],{"t":10,"c":631},"Here are a couple maps: ",{"t":37,"c":633},[634,637,640],[40,635,636],[],[],[638],{"t":10,"c":639},"here’s a typical one",[641,40],"http:\u002F\u002Fcollections.lib.uwm.edu\u002Fcdm\u002Fref\u002Fcollection\u002Fagdm\u002Fid\u002F1717",{"t":10,"c":643},"; ",{"t":37,"c":645},[646,649,652],[40,647,648],[],[],[650],{"t":10,"c":651},"this one of the North Sea",[653,40],"http:\u002F\u002Fcollections.lib.uwm.edu\u002Fcdm\u002Fsingleitem\u002Fcollection\u002Fagdm\u002Fid\u002F1724\u002Frec\u002F11",{"t":10,"c":655}," is a bit less of a mess. I actually think the Naval Observatory produces really terrible graphic design compared to its contemporaries; although it sort of works, it’s hardly legible compared to stuff the Census bureau would start putting out. Not that that really matters.",{"t":461,"c":657},[421,463],{"t":373,"c":659},[395,660,664],[661,662,663],"i-made-them-in-r-using-ggplot2-libraries.",[],[],[665],{"t":10,"c":666},"I made them in R, using ggplot2 libraries.",{"t":32,"c":668},[669,677,678,681,682],{"t":37,"c":670},[671,674,676],[40,672,673],[],[],[675],{"t":10,"c":482},[484,40],{"t":10,"c":417},{"t":419,"c":679},[421,680],"\u003Ctime datetime=\"2014-04-01T09:53:23.116-04:00\"\u003E",{"t":10,"c":560},{"t":419,"c":683},[421,427],{"t":32,"c":685},[686,688,698],{"t":10,"c":687},"I made them in R, using ggplot2 libraries. ",{"t":37,"c":689},[690,693,696],[40,691,692],[],[],[694],{"t":10,"c":695},"Here’s the plotting code.",[697,40],"https:\u002F\u002Fgist.github.com\u002Fbmschmidt\u002F9914296",{"t":10,"c":699},"Honestly, I spent forever trying to render them in D3 so they could overlay with some animations, but just couldn’t get the svg exports to render quickly enough. So back to R.",{"t":461,"c":701},[421,463],{"t":373,"c":703},[395,704,708],[705,706,707],"love-the-visualizations-is-there-a-way-you-could",[],[],[709],{"t":10,"c":710},"Love the visualizations!! Is there a way you could…",{"t":32,"c":712},[713,722,723,726,728],{"t":37,"c":714},[715,718,721],[40,716,717],[],[],[719],{"t":10,"c":720},"Bob",[40,40],{"t":10,"c":417},{"t":419,"c":724},[421,725],"\u003Ctime datetime=\"2014-04-02T09:32:11.112-04:00\"\u003E",{"t":10,"c":727},"Apr 3, 2014",{"t":419,"c":729},[421,427],{"t":32,"c":731},[732],{"t":10,"c":733},"Love the visualizations!! Is there a way you could share the data sets here? Also, I’m interested in your D3 work. It’s a cool library and I’d love to see what you did with it.",{"t":461,"c":735},[421,463],{"t":373,"c":737},[395,738,742],[739,740,741],"from-a-new-zealand-view-i-cant-help-wondering",[],[],[743],{"t":10,"c":744},"From a New Zealand view I can’t help wondering…",{"t":32,"c":746},[747,756,757,760,762],{"t":37,"c":748},[749,752,754],[40,750,751],[],[],[753],{"t":10,"c":552},[755,40],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F14586290254444971774",{"t":10,"c":417},{"t":419,"c":758},[421,759],"\u003Ctime datetime=\"2014-05-10T07:01:19.975-04:00\"\u003E",{"t":10,"c":761},"May 6, 2014",{"t":419,"c":763},[421,427],{"t":32,"c":765},[766],{"t":10,"c":767},"From a New Zealand view I can’t help wondering why you don’t cut your maritime maps through the middle of Africa instead of through the Pacific!",{"t":461,"c":769},[421,463],{"t":373,"c":771},[395,772,776],[773,774,775],"maybe-something-like-this-httpeducation.nation",[],[],[777],{"t":10,"c":778},"Maybe something like this: http:\u002F\u002Feducation.nation…",{"t":32,"c":780},[781,789,790,793,795],{"t":37,"c":782},[783,786,788],[40,784,785],[],[],[787],{"t":10,"c":552},[755,40],{"t":10,"c":417},{"t":419,"c":791},[421,792],"\u003Ctime datetime=\"2014-06-17T19:06:33.369-04:00\"\u003E",{"t":10,"c":794},"Jun 2, 2014",{"t":419,"c":796},[421,427],{"t":32,"c":798},[799,801,802],{"t":10,"c":800},"Maybe something like this:",{"t":273},{"t":10,"c":803},"http:\u002F\u002Feducation.nationalgeographic.com\u002Feducation\u002Fmedia\u002Fselecting-map-projection\u002F?ar_a=1",{"t":461,"c":805},[421,463],{"t":373,"c":807},[395,808,812],[809,810,811],"oh-sorry-to-miss-this-yeah-i-only-cut-there-beca",[],[],[813],{"t":10,"c":814},"Oh sorry to miss this! Yeah, I only cut there beca…",{"t":32,"c":816},[817,825,826,829,830],{"t":37,"c":818},[819,822,824],[40,820,821],[],[],[823],{"t":10,"c":482},[484,40],{"t":10,"c":417},{"t":419,"c":827},[421,828],"\u003Ctime datetime=\"2014-06-17T19:17:07.367-04:00\"\u003E",{"t":10,"c":794},{"t":419,"c":831},[421,427],{"t":32,"c":833},[834],{"t":10,"c":835},"Oh sorry to miss this! Yeah, I only cut there because there’s something I kind of like about just plotting with the straight latitude coordinates on an equirectangular projection: nothing particularly great about it.",{"t":32,"c":837},[838,840,850,852,856,858,864,866],{"t":10,"c":839},"I’m using ",{"t":37,"c":841},[842,845,848],[40,843,844],[],[],[846],{"t":10,"c":847},"just that sort of altered goode-homolosine projection for the new animated version (unreleased, so just an image here)",[849,40],"http:\u002F\u002Fbenschmidt.org\u002Fmaury2.png",{"t":10,"c":851},". What I’d ",{"t":314,"c":853},[854],{"t":10,"c":855},"really",{"t":10,"c":857}," like is the Bartholomew ",{"t":63,"c":859},[860,861],{"t":66},[862],{"t":10,"c":863},"Lotus",{"t":10,"c":865}," projection, which only has one minor cut, but I’ve found most people find it confusing ",{"t":37,"c":867},[868,871,874],[40,869,870],[],[],[872],{"t":10,"c":873},"(slightly misshapen example here)",[875,40],"http:\u002F\u002Fbenschmidt.org\u002Fmaurylotus.png",{"t":461,"c":877},[421,463],{"t":373,"c":879},[395,880,884],[881,882,883],"yes-both-very-appealing-for-maritime-uses.-maybe",[],[],[885],{"t":10,"c":886},"Yes, both very appealing for maritime uses. Maybe …",{"t":32,"c":888},[889,897,898,901,903],{"t":37,"c":890},[891,894,896],[40,892,893],[],[],[895],{"t":10,"c":552},[755,40],{"t":10,"c":417},{"t":419,"c":899},[421,900],"\u003Ctime datetime=\"2014-06-21T06:29:15.712-04:00\"\u003E",{"t":10,"c":902},"Jun 6, 2014",{"t":419,"c":904},[421,427],{"t":32,"c":906},[907],{"t":10,"c":908},"Yes, both very appealing for maritime uses. Maybe not for a study of the Northwest Passage!",{"t":461,"c":910},[421,463],{"created":912,"edited":912,"filename":913,"title":25,"date":914,"draft":14,"url":29,"tags":915},"2023-02-10T22:07:18.434Z","shipping-maps-and-how-states-see","2014-03-31T18:51:00.003Z",[21]],"uses":{"params":["slug"]}}]}