{"type":"data","nodes":[{"type":"data","data":[null],"uses":{}},{"type":"data","data":[{"document":1,"metadata":714},{"pandoc-api-version":2,"meta":5,"blocks":31},[3,4,3],1,22,{"date":6,"draft":12,"title":15,"url":27},{"t":7,"c":8},"MetaInlines",[9],{"t":10,"c":11},"Str","2017-09-15T11:41:00.004-04:00",{"t":13,"c":14},"MetaBool",false,{"t":7,"c":16},[17,25],{"t":18,"c":19},"Quoted",[20,22],{"t":21},"DoubleQuote",[23],{"t":10,"c":24},"Peer review",{"t":10,"c":26}," is younger than you think. Does that mean it can go away?",{"t":7,"c":28},[29],{"t":10,"c":30},"\u002F2017\u002F09\u002Fpeer-review-is-younger-than-you-think.html",[32,40,90,120,132,136,185,213,231,235,261,303,307,311,339,350,390,426,430,442,446,450,454,458,468,480,499,509,519,544,548,552,561,581,589,593,597,599,608,627,630,632,641,661,668,670,679,697,708,712],{"t":33,"c":34},"Para",[35],{"t":36,"c":37},"Emph",[38],{"t":10,"c":39},"This is a blog post I’ve had sitting around in some form for a few years; I wanted to post it today because:",{"t":33,"c":41},[42,72,74],{"t":36,"c":43},[44,46,58,60,70],{"t":10,"c":45},"1) It’s about peer review, and it’s ",{"t":47,"c":48},"Link",[49,53,56],[50,51,52],"",[],[],[54],{"t":10,"c":55},"peer review week",[57,50],"https:\u002F\u002Fpeerreviewweek.wordpress.com\u002F",{"t":10,"c":59},"! I just read ",{"t":47,"c":61},[62,65,68],[50,63,64],[],[],[66],{"t":10,"c":67},"this nice piece by Ken Wissoker",[69,50],"https:\u002F\u002Fdukeupress.wordpress.com\u002F2017\u002F09\u002F14\u002Feditorial-director-ken-wissoker-on-why-he-loves-peer-review\u002F",{"t":10,"c":71}," in its defense.",{"t":73},"LineBreak",{"t":36,"c":75},[76,78,88],{"t":10,"c":77},"2) There’s a conference on ",{"t":47,"c":79},[80,83,86],[50,81,82],[],[],[84],{"t":10,"c":85},"argumentation in Digital History",[87,50],"https:\u002F\u002Frrchnm.org\u002Fnews\u002Farguing-with-digital-history-workshop-to-address-a-central-problem-in-digital-history\u002F",{"t":10,"c":89}," this weekend at George Mason which I couldn’t attend for family reasons but wanted to resonate with at a distance. ",{"t":33,"c":91},[92],{"t":36,"c":93},[94,96,106,108,118],{"t":10,"c":95},"It’s still sketchy in places, but I’m putting it up as a provocation to think (and to tell me) more about the history of peer review, and how fundamentally malleable scholarly norms are, rather than as a completed historical essay in its own right. [Edit–for a longer and better-informed version of many of these points, particularly as they relate to the sciences, Konrad Lawson points out ",{"t":47,"c":97},[98,101,104],[50,99,100],[],[],[102],{"t":10,"c":103},"this essay by Aileen Fyfe",[105,50],"https:\u002F\u002Fwww.timeshighereducation.com\u002Ffeatures\u002Fpeer-review-not-old-you-might-think",{"t":10,"c":107},"; my old grad school colleague Melinda Baldwin has an essay in Physics Today from her forthcoming project that covers ",{"t":47,"c":109},[110,113,116],[50,111,112],[],[],[114],{"t":10,"c":115},"the whole shebang as well, with a particular emphasis on physics",[117,50],"http:\u002F\u002Fphysicstoday.scitation.org\u002Fdoi\u002F10.1063\u002FPT.3.3463",{"t":10,"c":119},".]",{"t":33,"c":121},[122,124,130],{"t":10,"c":123},"It’s easy, when writing about ",{"t":18,"c":125},[126,127],{"t":21},[128],{"t":10,"c":129},"the digital,",{"t":10,"c":131}," to become foolishly besotted by the radical transformation it offers. There’s sometimes a millenarian strand in the digital humanities that can be dangerous, foolish, or both, and which critics of the field occasionally seize on as evidence of its perfidy. But it’s just as great a betrayal of historical thinking to essentialize the recent past as to hope that technology lets us uproot the past. We should not fall short of imagining the changes that are possible in the disciplines; and we shouldn’t think that disciplines need revolve around particular ways of reviewing, arguing, or producing scholarship.",{"t":33,"c":133},[134],{"t":10,"c":135},"Here’s a short historical story about one thing we tend to essentialize, peer review. I find it useful for illustrating two things. The first is that scholarly concepts we think of as central to the field are often far more recent than we think. This is, I think, a hopeful story; it means the window for change may also be greater than we think. The second is that they are, indeed, intricately tied up with social and technological changes in living memory; the humanities are not some wonderful time container of practices back to Erasmus or even Matthew Arnold. I’m posting it now, after delivering it as a hand-wavy talk at Northeastern in 2015.",{"t":33,"c":137},[138,140,150,152,158,160,170,172,183],{"t":10,"c":139},"Peer review seems to be so fundamental to scholarship that we can hardly imagine a world without it. Conventional histories of peer review suggest that it is old indeed. Kathleen Fitzpatrick starts ",{"t":47,"c":141},[142,145,148],[50,143,144],[],[],[146],{"t":10,"c":147},"her discussion of its history",[149,50],"http:\u002F\u002Fmcpress.media-commons.org\u002Fplannedobsolescence\u002Fone\u002Fthe-history-of-peer-review\u002F",{"t":10,"c":151}," in the 1750s, although she suggests that the ",{"t":18,"c":153},[154,155],{"t":21},[156],{"t":10,"c":157},"history of peer review thus appears to have been both longer and shorter than we may realize,",{"t":10,"c":159}," extending back to the 17th century but still imperfect by the 1940s. Wikipedia editors are more firm in their straightforward assertion that is was developed by ",{"t":47,"c":161},[162,165,168],[50,163,164],[],[],[166],{"t":10,"c":167},"Henry Oldenburg",[169,167],"https:\u002F\u002Fen.wikipedia.org\u002Fwiki\u002FHenry_Oldenburg",{"t":10,"c":171}," (1619–1677), who built on the work of ",{"t":47,"c":173},[174,177,180],[50,175,176],[],[],[178],{"t":10,"c":179},"Ishāq ibn ʻAlī al-Ruhāwī",[181,182],"https:\u002F\u002Fen.wikipedia.org\u002Fwiki\u002FAl-Ruhawi","Al-Ruhawi",{"t":10,"c":184}," (854–931). (Wikipedia is less clear on just how it quietly gestated for 7 centuries.)",{"t":33,"c":186},[187,189,195,197,203,205,211],{"t":10,"c":188},"But even if peer review is ancient, ",{"t":18,"c":190},[191,192],{"t":21},[193],{"t":10,"c":194},"peer review",{"t":10,"c":196}," itself is quite new. I was surprised, a few years ago, in performing anachronism consulting for the show ",{"t":18,"c":198},[199,200],{"t":21},[201],{"t":10,"c":202},"Masters of Sex,",{"t":10,"c":204}," set in the early 1960s, to see my algorithms reject one character’s suggestion that Masters and Johnson needed to publish in peer reviewed journals as hopelessly anachronistic. But that is indeed the case. Google Ngrams shows only sporadic uses before about 1970; the adjectival form ",{"t":18,"c":206},[207,208],{"t":21},[209],{"t":10,"c":210},"peer reviewed,",{"t":10,"c":212}," as adhering to scholarship, barely exists before 1980. (As always, you should basically ignore Google Ngrams results from after 2000, but why not include them?)",{"t":33,"c":214},[215],{"t":47,"c":216},[217,220,230],[50,218,219],[],[],[221],{"t":222,"c":223},"Image",[224,227,228],[50,225,226],[],[],[],[229,50],"https:\u002F\u002F3.bp.blogspot.com\u002F-seXThjZaWsY\u002FWXpO-g3ToFI\u002FAAAAAAAAJMw\u002F4Qe3x0Q9CTUyva2N99K6empKAQrz1hy5ACLcBGAs\u002Fs1600\u002FScreen%2BShot%2B2017-07-27%2Bat%2B4.00.20%2BPM.png",[229,50],{"t":33,"c":232},[233],{"t":10,"c":234},"Of course the thing may exist before the word: but one thing I’ve found invariably in looking at these etymologies is words usually do not march straight out of the primordial ooze into widespread use for no reason at all, particularly words describing so specific and unpoetic as a practice like this. Usually there is some reason, some new thing in the world that requires a new term to distinguish it from what has come before.",{"t":33,"c":236},[237,239,245,247,253,255],{"t":10,"c":238},"So what new thing gave rise to peer review? Reading through the texts gives some sense. JStor contains no uses of the phrase until 1965, in reference to ",{"t":18,"c":240},[241,242],{"t":21},[243],{"t":10,"c":244},"peer review groups",{"t":10,"c":246}," at the NIH. Through the late 1960s the phrase was only used in the context of doctors supervising medical care of other doctors. The first use outside of medicine I find is in 1969, in a library sciences context,1 also about professional self-evaluation. An early usage for grants is in 1970.2 The first usage of the phrase in the American Historical Review is in 1978, in a decidedly negative evaluation of the ",{"t":18,"c":248},[249,250],{"t":21},[251],{"t":10,"c":252},"peer review bureaucracies of foundations and government,",{"t":10,"c":254}," ",{"t":18,"c":256},[257,258],{"t":21},[259],{"t":10,"c":260},"manned by scientists of lesser achievement.",{"t":33,"c":262},[263,265,275,277,283,285,301],{"t":10,"c":264},"So what is the new thing being described here? As best as I can tell, the reason for its existence is the rise of the new government funding bureaucracy in the 1960s; the NIH, the NSF, and their smaller cousins like the NEH all needed mechanisms to distribute their new government largess: and peer review was a way to ensure that government money was not handed out by the government, but by experts from the scientific community. (This story, by the way, bears an interesting relationship to the one I wrote earlier this month about ",{"t":47,"c":266},[267,270,273],[50,268,269],[],[],[271],{"t":10,"c":272},"government attributes versus public ones",[274,50],"http:\u002F\u002Fsappingattention.blogspot.com\u002F2017\u002F07\u002Fwhat-is-described-as-belonging-to.html",{"t":10,"c":276},"; that sentence would have a different valence if I said that scholars wished to ensure the ",{"t":18,"c":278},[279,280],{"t":21},[281],{"t":10,"c":282},"public money was not handed out by the public.",{"t":10,"c":284},") Its use in non-publication situations–peer review boards investigating medical malpractice, for example–is almost entirely about protecting professional organizations from state or other bureaucratic interference. And when there are large-scale discussions of peer review in science–as in a ",{"t":47,"c":286},[287,290,299],[50,288,289],[],[],[291,293],{"t":10,"c":292},"special 1985 edition of ",{"t":18,"c":294},[295,296],{"t":21},[297],{"t":10,"c":298},"Science, Technology, and Human values,",[300,50],"http:\u002F\u002Fjournals.sagepub.com\u002Ftoc\u002Fsthd\u002F10\u002F3",{"t":10,"c":302}," they frequently take grant-making as the archetypal form, not the refereeing of scholarship.",{"t":33,"c":304},[305],{"t":10,"c":306},"The central technology that causes this new term to spread to scholarship, then, is the grantmaking state. But this relies on a more prosaic technology, as well. Peer review is the archetypal form of scholarly organization in the age of the xerox machine. Without it, a sheaf of grant proposal could not be easily snapped into a binder, mailed across the country, and then (perhaps) flown back to Washington with its expert reader for discussion.",{"t":33,"c":308},[309],{"t":10,"c":310},"Digging around a little recently, I see that historian of science Alex Czsisar wrote a short piece for Nature in 2016 (after I gave this as a talk, so not fully incorporated here) where he says this, which is very much along the same lines.",{"t":312,"c":313},"BlockQuote",[314],{"t":33,"c":315},[316,322,324,330,332,337],{"t":18,"c":317},[318,320],{"t":319},"SingleQuote",[321],{"t":10,"c":24},{"t":10,"c":323}," was a term borrowed from the procedures that government agencies used to decide who would receive financial support for scientific and medical research. When ",{"t":18,"c":325},[326,327],{"t":319},[328],{"t":10,"c":329},"referee systems",{"t":10,"c":331}," turned into ",{"t":18,"c":333},[334,335],{"t":319},[336],{"t":10,"c":194},{"t":10,"c":338},", the process became a mighty public symbol of the claim that these powerful and expensive investigators of the natural world had procedures for regulating themselves and for producing consensus, even though some observers quietly wondered whether scientific referees were up to this grand calling.",{"t":33,"c":340},[341,343,348],{"t":10,"c":342},"All of this suggests, though it doesn’t prove, that the shift to a language of ",{"t":18,"c":344},[345,346],{"t":21},[347],{"t":10,"c":194},{"t":10,"c":349}," involves a model of research that draws on a nationally organized scientific funding system that merges with a series of older traditions. Most of the histories of peer review in the sciences note how late journals were to adopt it: leading British publications like the Lancet and Nature don’t take up outside peer reviewers until the 1970s.",{"t":33,"c":351},[352,354,360,362,368,370,380,382,388],{"t":10,"c":353},"If the history of peer review in the sciences is young, the history of peer review in the humanities is even younger. The earliest usage in the front-or-back matter of the American Historical Review that I see at first glance is from 1996, in describing who can perform book reviews; the second use outside a history-of-science context is in 1997, when Sheila Fitzpatrick notes unhappily that a book has obviously ",{"t":18,"c":355},[356,357],{"t":21},[358],{"t":10,"c":359},"undergone extensive peer review",{"t":10,"c":361}," in a way that weakens it, serving as an ",{"t":18,"c":363},[364,365],{"t":21},[366],{"t":10,"c":367},"uncomfortable reminder that peer review may function not only as a gate-keeping procedure but also as a kind of censorship of unpopular opinions.",{"t":10,"c":369}," (Here’s ",{"t":47,"c":371},[372,375,378],[50,373,374],[],[],[376],{"t":10,"c":377},"a similar 2012 argument",[379,50],"https:\u002F\u002Fwww.ncbi.nlm.nih.gov\u002Fpubmed\u002F23054375",{"t":10,"c":381}," in favor of editorial review, *not* peer review, in a science journal). (Not far down the list is Ayers and Thomas’s 2003 digital article ",{"t":18,"c":383},[384,385],{"t":21},[386],{"t":10,"c":387},"The Differences Slavery Made;",{"t":10,"c":389}," rather than showing up to challenge decades of consensus on peer review, digital scholarship was already arriving on the hardly after the consensus had set).",{"t":33,"c":391},[392,394,400,402,412,414,424],{"t":10,"c":393},"I’d have to do more research to really understand what the outside review policies of leading journals were in the (say) 1950s and 1960s. I have the impression, but have lost the reference, that at least single-copy referee reviewing was common, if not mandatory, in the period. (",{"t":18,"c":395},[396,397],{"t":21},[398],{"t":10,"c":399},"Outside referee,",{"t":10,"c":401}," though, is another 1960s neologism.) Still, the technology of mimeographs and carbon copies makes for different forms of outside review: In 1956, the ",{"t":47,"c":403},[404,407,410],[50,405,406],[],[],[408],{"t":10,"c":409},"AHR only demanded a single paper copy of each article",[411,50],"https:\u002F\u002Fwww.jstor.org\u002Fstable\u002F1848581?Search=yes&resultItemClick=true&searchText=%22carbon%20copy%22&searchUri=%2Faction%2FdoBasicSearch%3Ffilter%3Djid%253A10.2307%252Fj100010%26amp%3BQuery%3D%2522carbon%2Bcopy%2522&refreqid=search%3A4774cf3ea701092e473e6c5d6bac3339&seq=2#page_scan_tab_contents",{"t":10,"c":413}," submitted. (The ribbon copy, please; keep the carbon copy for yourself.) This ",{"t":47,"c":415},[416,419,422],[50,417,418],[],[],[420],{"t":10,"c":421},"seems to have been still true in 1970",[423,50],"https:\u002F\u002Fwww.jstor.org\u002Fstable\u002F1848020?seq=4#page_scan_tab_contents",{"t":10,"c":425},"; I suppose by then the AHR could have been paying for photocopies on their own, but I doubt they did. By 1980, the number of required copies number has increased to 2; by the late 1990s, the frontmatter demanded four, or a Microsoft-compatible disk, which is what it would take for a really modern peer review system. But surely I’ve said enough now that someone will chime in in the comments about how mimeographs were sent to various reviewers in serial.",{"t":33,"c":427},[428],{"t":10,"c":429},"I know even less about monographs; but it should be widely known that some important work in the field *continues* to be published as part of edited volumes, trade presses, and other channels subject only to editorial review, not peer review.",{"t":33,"c":431},[432,434,440],{"t":10,"c":433},"So what? Obviously peer review didn’t *really* come into being in the historical profession in 1995. That’s ridiculous! Books and journals had various forms of outside referees in the mimeograph\u002Fcarbon copy age as well. But the point is this: something did change, and more recently than we might think. Peer review was created, rather than always existing in the humanities; its rhetorical adoption in those fields as a core term may be less connected to eternal ideas of scholarship, and have more to do with the effort to make them more like the sciences in the postwar university. Be skeptical of the administrative-ese, buzzword-inflected vogue for the digital humanities all you want: but also, be aware that if you say ",{"t":18,"c":435},[436,437],{"t":21},[438],{"t":10,"c":439},"peer review is fundamental to sound scholarship,",{"t":10,"c":441}," you’re speaking in the buzzwords of not long ago, yourself.",{"t":33,"c":443},[444],{"t":10,"c":445},"I wouldn’t argue in good faith that peer review is new, so it’s bad. It might be that the scholarly practices from 1970 to 2010 are indeed worth preserving.",{"t":33,"c":447},[448],{"t":10,"c":449},"But at the same time, I’m not sure that digital scholarship could ever fully reconcile itself to peer review in the traditional sense without transforming it enough that we’ll need a whole new phrase to describe the new regime to come.",{"t":33,"c":451},[452],{"t":10,"c":453},"Randomly selected bibliography:",{"t":33,"c":455},[456],{"t":10,"c":457},"Some early citations, and some previous histories.",{"t":33,"c":459},[460,466],{"t":18,"c":461},[462,463],{"t":21},[464],{"t":10,"c":465},"Atlantic City Conference: A Great Show–in Two Parts and a Cast of Thousands.",{"t":10,"c":467}," ALA Bulletin 63, no. 7 (): 915–964. http:\u002F\u002Fwww.jstor.org\u002Fstable\u002F 25698237.",{"t":33,"c":469},[470,472,478],{"t":10,"c":471},"Cooper, Joseph D. ",{"t":18,"c":473},[474,475],{"t":21},[476],{"t":10,"c":477},"Onward the Management of Science: The Wooldridge Report.",{"t":10,"c":479}," Science 148, no. 3676. New Series (): 1433–1439. http:\u002F\u002Fwww.jstor.org\u002F stable\u002F1716537.",{"t":481,"c":482},"Header",[483,484,488],2,[485,486,487],"csiszar-alex.-peer-review-troubled-from-the-start.-nature-news-532-no.-7599-april-21-2016-306.-doi10.1038532306a.",[],[],[489,491,497],{"t":10,"c":490},"Csiszar, Alex. ",{"t":18,"c":492},[493,494],{"t":21},[495],{"t":10,"c":496},"Peer Review: Troubled from the Start.",{"t":10,"c":498}," Nature News 532, no. 7599 (April 21, 2016): 306. doi:10.1038\u002F532306a.",{"t":481,"c":500},[501,502,506],3,[503,504,505],"comments",[],[],[507],{"t":10,"c":508},"Comments:",{"t":481,"c":510},[511,512,516],4,[513,514,515],"very-important-work-worth-continuing-and-spreadin",[],[],[517],{"t":10,"c":518},"Very important work, worth continuing and spreadin…",{"t":33,"c":520},[521,532,534,539,541],{"t":47,"c":522},[523,526,529],[50,524,525],[],[],[527],{"t":10,"c":528},"Brett",[530,531],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F16865985571583978032","noreply@blogger.com",{"t":10,"c":533}," - ",{"t":535,"c":536},"RawInline",[537,538],"html","\u003Ctime datetime=\"2017-09-16T22:04:34.603-04:00\"\u003E",{"t":10,"c":540},"Sep 6, 2017",{"t":535,"c":542},[537,543],"\u003C\u002Ftime\u003E",{"t":33,"c":545},[546],{"t":10,"c":547},"Very important work, worth continuing and spreading far and wide. Well done.",{"t":549,"c":550},"RawBlock",[537,551],"\u003Chr \u002F\u003E",{"t":481,"c":553},[511,554,558],[555,556,557],"as-always-you-should-basically-ignore-googl",[],[],[559],{"t":10,"c":560},"“As always, you should basically ignore Googl…",{"t":33,"c":562},[563,573,574,577,579],{"t":47,"c":564},[565,568,571],[50,566,567],[],[],[569],{"t":10,"c":570},"Steve Sailer",[572,50],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F11920109042402850214",{"t":10,"c":533},{"t":535,"c":575},[537,576],"\u003Ctime datetime=\"2017-09-17T01:44:07.138-04:00\"\u003E",{"t":10,"c":578},"Sep 0, 2017",{"t":535,"c":580},[537,543],{"t":33,"c":582},[583],{"t":18,"c":584},[585,586],{"t":21},[587],{"t":10,"c":588},"As always, you should basically ignore Google Ngrams results from after 2000, but why not include them?",{"t":33,"c":590},[591],{"t":10,"c":592},"My impression is that 2008 (the last year in the data base) has only partial data, which is why if you set the time period to run through 2008 the graph almost always dips precipitously at the end. Because nGram normally smooths results, this makes all the recent data look bad.",{"t":33,"c":594},[595],{"t":10,"c":596},"However, I think the data is pretty good through 2007.",{"t":549,"c":598},[537,551],{"t":481,"c":600},[511,601,605],[602,603,604],"growth-parallel-to-emerging-internet",[],[],[606],{"t":10,"c":607},"Growth parallel to emerging Internet?",{"t":33,"c":609},[610,620,621,624,625],{"t":47,"c":611},[612,615,618],[50,613,614],[],[],[616],{"t":10,"c":617},"Antony",[619,50],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F07410690681268905487",{"t":10,"c":533},{"t":535,"c":622},[537,623],"\u003Ctime datetime=\"2017-09-17T23:09:36.944-04:00\"\u003E",{"t":10,"c":578},{"t":535,"c":626},[537,543],{"t":33,"c":628},[629],{"t":10,"c":607},{"t":549,"c":631},[537,551],{"t":481,"c":633},[511,634,638],[635,636,637],"for-the-adoption-of-peer-review-in-the-humanities",[],[],[639],{"t":10,"c":640},"For the adoption of peer review in the humanities …",{"t":33,"c":642},[643,653,654,657,659],{"t":47,"c":644},[645,648,651],[50,646,647],[],[],[649],{"t":10,"c":650},"Aileen Fyfe",[652,50],"https:\u002F\u002Fwww.blogger.com\u002Fprofile\u002F15866706898579276306",{"t":10,"c":533},{"t":535,"c":655},[537,656],"\u003Ctime datetime=\"2017-09-18T16:07:13.529-04:00\"\u003E",{"t":10,"c":658},"Sep 1, 2017",{"t":535,"c":660},[537,543],{"t":33,"c":662},[663,665,666],{"t":10,"c":664},"For the adoption of peer review in the humanities and social sciences in the 1950s\u002F60s (and particularly for the choice of double-blind rather than single blind) see Pontille and Torny:",{"t":73},{"t":10,"c":667},"http:\u002F\u002Fadanewmedia.org\u002F2014\u002F04\u002Fissue4-pontilletorny\u002F",{"t":549,"c":669},[537,551],{"t":481,"c":671},[511,672,676],[673,674,675],"youre-entirely-right-that-the-enthusiasm-for",[],[],[677],{"t":10,"c":678},"You’re entirely right that the enthusiasm for …",{"t":33,"c":680},[681,689,690,693,695],{"t":47,"c":682},[683,686,688],[50,684,685],[],[],[687],{"t":10,"c":650},[652,50],{"t":10,"c":533},{"t":535,"c":691},[537,692],"\u003Ctime datetime=\"2017-09-20T04:07:47.488-04:00\"\u003E",{"t":10,"c":694},"Sep 3, 2017",{"t":535,"c":696},[537,543],{"t":33,"c":698},[699,701,706],{"t":10,"c":700},"You’re entirely right that the enthusiasm for the term ",{"t":18,"c":702},[703,704],{"t":319},[705],{"t":10,"c":194},{"t":10,"c":707}," is new, as the forthcoming papers from Melinda Baldwin, and from me (with Noah Moxham) make clear for the sciences. Yes, it seems to be linked to the rise of the grant-making state. But there’s also an interesting geographical question: all the instances we know about so far (see Baldwin) are about the USA. So why\u002Fwhen did other countries jump on the peer review bandwagon? We know very little about that…",{"t":33,"c":709},[710],{"t":10,"c":711},"Re technology: I agree that editorial requests to authors to send in multiple copies does suggest that a reviewing process is going on. However, the lack of such request does not imply the opposite. Throughout the 19thC and early 20thC, the Royal Society (London) sent the single unique copy of the manuscript to one, two or more referees as necessary, one after the other; and thankfully the Victorian postal service was pretty good (the only issues I’ve spotted in the archive about papers getting lost involved them being mislaid in the referee’s house, not lost in the post).",{"t":549,"c":713},[537,551],{"title":715,"date":716,"draft":14,"url":30},"\"Peer review\" is younger than you think. Does that mean it can go away?","2017-09-15T15:41:00.004Z"],"uses":{"params":["slug"]}}]}